ruby/A.org
#+TITLE:     A
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 3
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
 #+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: <a href="#bottom">⇩</a>
#+HTML: <a id="top"/>
#+HTML: </div>


* [[https://wordsinasentence.com/abate-in-a-sentence/][Abate]]

  =to reduce in degree or intensity=

  - I hope this medicine will abate the pain in my leg.
  - In time, his anger will abate, and he will forgive you.
  - With any luck, the storm will abate soon so we can still have our picnic.
  - The firemen sprayed water on the burning house to abate the structural damage.
  - Because the paparazzi kept following the celebrity around town, the media coverage did not seem as though it would ever abate.
  - I married my husband because I know my love for him will never abate.
  - By adding an extra lane to the highway, we can abate the traffic congestion during rush hour.



