ruby/A.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-06-19 Tue 21:46 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>A</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">A</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2b01de1">1. Abate</a></li>
<li><a href="#org839b5af">2. Abeyance</a></li>
<li><a href="#orga216e7a">3. Ablaze</a></li>
<li><a href="#orgb5fb638">4. Abrasive</a></li>
<li><a href="#org0e14247">5. Abreast</a></li>
<li><a href="#org2597dbe">6. Abridge</a></li>
<li><a href="#orgc72f50b">7. Abstruse</a></li>
<li><a href="#org9f3eb5d">8. Abut</a></li>
<li><a href="#orgff6265c">9. Accede</a></li>
<li><a href="#org4586343">10. Accredit</a></li>
<li><a href="#org5e25c7d">11. Adamant</a></li>
<li><a href="#org0c00768">12. Admonish</a></li>
<li><a href="#org283fea0">13. Adumbrate</a></li>
<li><a href="#org74bcfc0">14. Afflicted</a></li>
<li><a href="#org63769f8">15. Affront</a></li>
<li><a href="#org166fb2b">16. Aggrandize</a></li>
<li><a href="#org72e442b">17. Aghast</a></li>
<li><a href="#org70d8d3a">18. Agoraphobia</a></li>
<li><a href="#org63c6518">19. Allegiance</a></li>
<li><a href="#orga34970d">20. Allegory</a></li>
<li><a href="#orgd588db2">21. Allude</a></li>
<li><a href="#orgbe9c15f">22. Allusion</a></li>
<li><a href="#org312d162">23. Allusive</a></li>
<li><a href="#org6fbd6c3">24. Aloof</a></li>
<li><a href="#orge9d977a">25. Amalgam</a></li>
<li><a href="#org169d0c1">26. Ambidextrous</a></li>
<li><a href="#org1623999">27. Ambivalent</a></li>
<li><a href="#orge0bec70">28. Amble</a></li>
<li><a href="#orgdcbf0d1">29. Ameliorate</a></li>
<li><a href="#org1fbe722">30. Anaerobic</a></li>
<li><a href="#org878ca0e">31. Anathema</a></li>
<li><a href="#orgf48b4c7">32. Angular</a></li>
<li><a href="#org70fa481">33. Animosity</a></li>
<li><a href="#org4fcec1b">34. Anomalous</a></li>
<li><a href="#orge2e50a7">35. Antagonize</a></li>
<li><a href="#org8bb3851">36. Anticlimactic</a></li>
<li><a href="#org38ca4fe">37. Antithesis</a></li>
<li><a href="#org09b48ce">38. Apathetic</a></li>
<li><a href="#org4db83b7">39. Aphorism</a></li>
<li><a href="#orgdff2124">40. Apprise</a></li>
<li><a href="#orgfb33333">41. Approbation</a></li>
<li><a href="#orge205e52">42. Apropos</a></li>
<li><a href="#orgd639f5d">43. Arable</a></li>
<li><a href="#org9fbb186">44. Arboreal</a></li>
<li><a href="#orgcf978b1">45. Arduous</a></li>
<li><a href="#org50a00c7">46. Articulate</a></li>
<li><a href="#orga7804ed">47. Ascetic</a></li>
<li><a href="#org183a893">48. Ascribe</a></li>
<li><a href="#org4a02ed4">49. Assail</a></li>
<li><a href="#org21f69b5">50. Assiduous</a></li>
<li><a href="#org21d87a8">51. Assimilate</a></li>
<li><a href="#orgf9d78cb">52. Astute</a></li>
<li><a href="#orgc715699">53. Asunder</a></li>
<li><a href="#org6118406">54. Atone</a></li>
<li><a href="#org1e80d2f">55. Atrocity</a></li>
<li><a href="#org812d9ca">56. Atrophy</a></li>
<li><a href="#org077fabf">57. Attest</a></li>
<li><a href="#org3e4c146">58. Attrition</a></li>
<li><a href="#org25a5099">59. Attune</a></li>
<li><a href="#org2324cd3">60. Audacious</a></li>
<li><a href="#orge1303a3">61. Auspices</a></li>
<li><a href="#org52588fb">62. Auspicious</a></li>
<li><a href="#orgd0189f1">63. Austere</a></li>
<li><a href="#orgf6ea45a">64. Avarice</a></li>
<li><a href="#orga2e7cb7">65. Avaricious</a></li>
<li><a href="#org469b4f9">66. Averse</a></li>
<li><a href="#org3f53775">67. Avocation</a></li>
<li><a href="#orgdb34868">68. Axiom</a></li>
<li><a href="#org77a2691">69. Abase</a></li>
<li><a href="#orga230dfe">70. Abash</a></li>
<li><a href="#orgbef632e">71. Abdicate</a></li>
<li><a href="#org217684a">72. Abjure</a></li>
<li><a href="#orgc279c25">73. Abnegation</a></li>
<li><a href="#orga625daf">74. Abominate</a></li>
<li><a href="#org518cadc">75. Abraded</a></li>
<li><a href="#org47e3da4">76. Abrogate</a></li>
<li><a href="#orgf0cce7c">77. Abstemious</a></li>
<li><a href="#org90642b4">78. Abstention</a></li>
<li><a href="#org29c54c7">79. Abstinence</a></li>
<li><a href="#org4e99c62">80. Acclaim</a></li>
<li><a href="#org2da63b5">81. Accosted</a></li>
<li><a href="#org4dd3700">82. Accretion</a></li>
<li><a href="#org21a6da6">83. Accrue</a></li>
<li><a href="#org97f8bfc">84. Acquittal</a></li>
<li><a href="#org74907b5">85. Acuity</a></li>
<li><a href="#orgf42ada8">86. Acumen</a></li>
<li><a href="#orgdfc29cd">87. Addle</a></li>
<li><a href="#orgec5e50c">88. Adduce</a></li>
<li><a href="#org9d517fe">89. Adjourn</a></li>
<li><a href="#orgbd8c182">90. Adjudicate</a></li>
<li><a href="#orgbf14b31">91. Adolescence</a></li>
<li><a href="#org47c9965">92. Adroit</a></li>
<li><a href="#org73875e0">93. Adulterate</a></li>
<li><a href="#org859c1b9">94. Advent</a></li>
<li><a href="#org79d79a3">95. Adventitious</a></li>
<li><a href="#orgeaa928b">96. Advert</a></li>
<li><a href="#org6e53a54">97. Aerate</a></li>
<li><a href="#org12e1ad4">98. Aftermath</a></li>
<li><a href="#orga9d1d60">99. Agape</a></li>
<li><a href="#orgb4bc669">100. Agnostic</a></li>
<li><a href="#org4621a80">101. Agog</a></li>
<li><a href="#org7e07664">102. Ague</a></li>
<li><a href="#org15f5345">103. Ail</a></li>
<li><a href="#org31ced37">104. Aleatory</a></li>
<li><a href="#orgac5ec6c">105. Allay</a></li>
<li><a href="#orgf6d6e79">106. Ambient</a></li>
<li><a href="#orgfa6d5f7">107. Amnesty</a></li>
<li><a href="#org821bb86">108. Ancillary</a></li>
<li><a href="#orgd93fe57">109. Animadversion</a></li>
<li><a href="#orge81c736">110. Animus</a></li>
<li><a href="#org74ec168">111. Anneal</a></li>
<li><a href="#orgfa3684b">112. Annihilate</a></li>
<li><a href="#orgd0a974f">113. Antecedent</a></li>
<li><a href="#org33ff066">114. Aplomb</a></li>
<li><a href="#org243d521">115. Apostate</a></li>
<li><a href="#orgeebd3a4">116. Ardent</a></li>
<li><a href="#org3ea8ba4">117. Arraign</a></li>
<li><a href="#orgda0caef">118. Arrant</a></li>
<li><a href="#orgdeee961">119. Asinine</a></li>
<li><a href="#orgca6330e">120. Askance</a></li>
<li><a href="#org841dc9e">121. Askew</a></li>
<li><a href="#org07b640a">122. Aspersion</a></li>
<li><a href="#orgffb281b">123. Assent</a></li>
<li><a href="#org9ac3e85">124. Assuage</a></li>
<li><a href="#org9404ffa">125. Attire</a></li>
<li><a href="#orgb4906fc">126. Augury</a></li>
<li><a href="#org6000a63">127. August</a></li>
<li><a href="#org709bd7f">128. Aver</a></li>
<li><a href="#org520eb0e">129. Aversion</a></li>
<li><a href="#org688e45b">130. Avow</a></li>
<li><a href="#org38536ea">131. Awry</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2b01de1">1. Abate</a></li>
<li><a href="#org839b5af">2. Abeyance</a></li>
<li><a href="#orga216e7a">3. Ablaze</a></li>
<li><a href="#orgb5fb638">4. Abrasive</a></li>
<li><a href="#org0e14247">5. Abreast</a></li>
<li><a href="#org2597dbe">6. Abridge</a></li>
<li><a href="#orgc72f50b">7. Abstruse</a></li>
<li><a href="#org9f3eb5d">8. Abut</a></li>
<li><a href="#orgff6265c">9. Accede</a></li>
<li><a href="#org4586343">10. Accredit</a></li>
<li><a href="#org5e25c7d">11. Adamant</a></li>
<li><a href="#org0c00768">12. Admonish</a></li>
<li><a href="#org283fea0">13. Adumbrate</a></li>
<li><a href="#org74bcfc0">14. Afflicted</a></li>
<li><a href="#org63769f8">15. Affront</a></li>
<li><a href="#org166fb2b">16. Aggrandize</a></li>
<li><a href="#org72e442b">17. Aghast</a></li>
<li><a href="#org70d8d3a">18. Agoraphobia</a></li>
<li><a href="#org63c6518">19. Allegiance</a></li>
<li><a href="#orga34970d">20. Allegory</a></li>
<li><a href="#orgd588db2">21. Allude</a></li>
<li><a href="#orgbe9c15f">22. Allusion</a></li>
<li><a href="#org312d162">23. Allusive</a></li>
<li><a href="#org6fbd6c3">24. Aloof</a></li>
<li><a href="#orge9d977a">25. Amalgam</a></li>
<li><a href="#org169d0c1">26. Ambidextrous</a></li>
<li><a href="#org1623999">27. Ambivalent</a></li>
<li><a href="#orge0bec70">28. Amble</a></li>
<li><a href="#orgdcbf0d1">29. Ameliorate</a></li>
<li><a href="#org1fbe722">30. Anaerobic</a></li>
<li><a href="#org878ca0e">31. Anathema</a></li>
<li><a href="#orgf48b4c7">32. Angular</a></li>
<li><a href="#org70fa481">33. Animosity</a></li>
<li><a href="#org4fcec1b">34. Anomalous</a></li>
<li><a href="#orge2e50a7">35. Antagonize</a></li>
<li><a href="#org8bb3851">36. Anticlimactic</a></li>
<li><a href="#org38ca4fe">37. Antithesis</a></li>
<li><a href="#org09b48ce">38. Apathetic</a></li>
<li><a href="#org4db83b7">39. Aphorism</a></li>
<li><a href="#orgdff2124">40. Apprise</a></li>
<li><a href="#orgfb33333">41. Approbation</a></li>
<li><a href="#orge205e52">42. Apropos</a></li>
<li><a href="#orgd639f5d">43. Arable</a></li>
<li><a href="#org9fbb186">44. Arboreal</a></li>
<li><a href="#orgcf978b1">45. Arduous</a></li>
<li><a href="#org50a00c7">46. Articulate</a></li>
<li><a href="#orga7804ed">47. Ascetic</a></li>
<li><a href="#org183a893">48. Ascribe</a></li>
<li><a href="#org4a02ed4">49. Assail</a></li>
<li><a href="#org21f69b5">50. Assiduous</a></li>
<li><a href="#org21d87a8">51. Assimilate</a></li>
<li><a href="#orgf9d78cb">52. Astute</a></li>
<li><a href="#orgc715699">53. Asunder</a></li>
<li><a href="#org6118406">54. Atone</a></li>
<li><a href="#org1e80d2f">55. Atrocity</a></li>
<li><a href="#org812d9ca">56. Atrophy</a></li>
<li><a href="#org077fabf">57. Attest</a></li>
<li><a href="#org3e4c146">58. Attrition</a></li>
<li><a href="#org25a5099">59. Attune</a></li>
<li><a href="#org2324cd3">60. Audacious</a></li>
<li><a href="#orge1303a3">61. Auspices</a></li>
<li><a href="#org52588fb">62. Auspicious</a></li>
<li><a href="#orgd0189f1">63. Austere</a></li>
<li><a href="#orgf6ea45a">64. Avarice</a></li>
<li><a href="#orga2e7cb7">65. Avaricious</a></li>
<li><a href="#org469b4f9">66. Averse</a></li>
<li><a href="#org3f53775">67. Avocation</a></li>
<li><a href="#orgdb34868">68. Axiom</a></li>
<li><a href="#org77a2691">69. Abase</a></li>
<li><a href="#orga230dfe">70. Abash</a></li>
<li><a href="#orgbef632e">71. Abdicate</a></li>
<li><a href="#org217684a">72. Abjure</a></li>
<li><a href="#orgc279c25">73. Abnegation</a></li>
<li><a href="#orga625daf">74. Abominate</a></li>
<li><a href="#org518cadc">75. Abraded</a></li>
<li><a href="#org47e3da4">76. Abrogate</a></li>
<li><a href="#orgf0cce7c">77. Abstemious</a></li>
<li><a href="#org90642b4">78. Abstention</a></li>
<li><a href="#org29c54c7">79. Abstinence</a></li>
<li><a href="#org4e99c62">80. Acclaim</a></li>
<li><a href="#org2da63b5">81. Accosted</a></li>
<li><a href="#org4dd3700">82. Accretion</a></li>
<li><a href="#org21a6da6">83. Accrue</a></li>
<li><a href="#org97f8bfc">84. Acquittal</a></li>
<li><a href="#org74907b5">85. Acuity</a></li>
<li><a href="#orgf42ada8">86. Acumen</a></li>
<li><a href="#orgdfc29cd">87. Addle</a></li>
<li><a href="#orgec5e50c">88. Adduce</a></li>
<li><a href="#org9d517fe">89. Adjourn</a></li>
<li><a href="#orgbd8c182">90. Adjudicate</a></li>
<li><a href="#orgbf14b31">91. Adolescence</a></li>
<li><a href="#org47c9965">92. Adroit</a></li>
<li><a href="#org73875e0">93. Adulterate</a></li>
<li><a href="#org859c1b9">94. Advent</a></li>
<li><a href="#org79d79a3">95. Adventitious</a></li>
<li><a href="#orgeaa928b">96. Advert</a></li>
<li><a href="#org6e53a54">97. Aerate</a></li>
<li><a href="#org12e1ad4">98. Aftermath</a></li>
<li><a href="#orga9d1d60">99. Agape</a></li>
<li><a href="#orgb4bc669">100. Agnostic</a></li>
<li><a href="#org4621a80">101. Agog</a></li>
<li><a href="#org7e07664">102. Ague</a></li>
<li><a href="#org15f5345">103. Ail</a></li>
<li><a href="#org31ced37">104. Aleatory</a></li>
<li><a href="#orgac5ec6c">105. Allay</a></li>
<li><a href="#orgf6d6e79">106. Ambient</a></li>
<li><a href="#orgfa6d5f7">107. Amnesty</a></li>
<li><a href="#org821bb86">108. Ancillary</a></li>
<li><a href="#orgd93fe57">109. Animadversion</a></li>
<li><a href="#orge81c736">110. Animus</a></li>
<li><a href="#org74ec168">111. Anneal</a></li>
<li><a href="#orgfa3684b">112. Annihilate</a></li>
<li><a href="#orgd0a974f">113. Antecedent</a></li>
<li><a href="#org33ff066">114. Aplomb</a></li>
<li><a href="#org243d521">115. Apostate</a></li>
<li><a href="#orgeebd3a4">116. Ardent</a></li>
<li><a href="#org3ea8ba4">117. Arraign</a></li>
<li><a href="#orgda0caef">118. Arrant</a></li>
<li><a href="#orgdeee961">119. Asinine</a></li>
<li><a href="#orgca6330e">120. Askance</a></li>
<li><a href="#org841dc9e">121. Askew</a></li>
<li><a href="#org07b640a">122. Aspersion</a></li>
<li><a href="#orgffb281b">123. Assent</a></li>
<li><a href="#org9ac3e85">124. Assuage</a></li>
<li><a href="#org9404ffa">125. Attire</a></li>
<li><a href="#orgb4906fc">126. Augury</a></li>
<li><a href="#org6000a63">127. August</a></li>
<li><a href="#org709bd7f">128. Aver</a></li>
<li><a href="#org520eb0e">129. Aversion</a></li>
<li><a href="#org688e45b">130. Avow</a></li>
<li><a href="#org38536ea">131. Awry</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Author</td>
<td class="org-left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="org-left">Date</td>
<td class="org-left">2018-06-19 21:46:31</td>
</tr>
</tbody>
</table>
<a href="#bottom">⇩</a>
<a id="top"/>
</div>


<div id="outline-container-org2b01de1" class="outline-2">
<h2 id="org2b01de1"><span class="section-number-2">1</span> <a href="https://wordsinasentence.com/abate-in-a-sentence/">Abate</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>to reduce in degree or intensity</code>
</p>

<ul class="org-ul">
<li>I hope this medicine will abate the pain in my leg.</li>
<li>In time, his anger will abate, and he will forgive you.</li>
<li>With any luck, the storm will abate soon so we can still have our picnic.</li>
<li>The firemen sprayed water on the burning house to abate the structural damage.</li>
<li>Because the paparazzi kept following the celebrity around town, the media coverage did not seem as though it would ever abate.</li>
<li>I married my husband because I know my love for him will never abate.</li>
<li>By adding an extra lane to the highway, we can abate the traffic congestion during rush hour.</li>
</ul>
</div>
</div>
