ruby/A.org
* [[https://wordsinasentence.com/abeyance-in-a-sentence/][Abeyance]]

  =a state of temporary disuse or suspension=

  - Immediately following the terrorist attack, pilots had to observe a period of abeyance where they could not depart from the airport.
  - Once the famine was over, the food rationing dictated by the government was put in abeyance.
  - Until after the murder trial, the inheritance will be placed in abeyance.
  - Trading on the stock market has temporarily been put in abeyance while the trade commission investigates financial misdeeds.
  - Because of Justin’s helpful testimony, the judge agreed to an abeyance of his sentence.
  - Near the end of the legislative session, the congressmen put several topics of discussion on abeyance until the next meeting.
  - Since the divorcing couple was unable to agree on a financial settlement, the judge placed the case in abeyance until an agreement could be reached.



* [[https://wordsinasentence.com/ablaze-in-a-sentence/][Ablaze]]

  =burning fiercely; in a blaze; on fire=

  - The cops threw Jack to the ground and arrested him after he set the American flag ablaze.
  - Before fleeing, the bandit set the home ablaze so that any possible evidence would be obliterated.
  - Eyes ablaze, the man with the black hat reached for his revolver and aimed it at Bob’s head.
  - After shooting the captive in the head, the terrorist *doused* Chris’s body with gasoline and set it ablaze.



* [[https://wordsinasentence.com/abrasive-in-a-sentence/][Abrasive]]

  =unlikeable; nasty=

  - Because of Kurt’s abrasive personality, most people try to avoid him at work.
  - The clerk was so abrasive to me I walked out the store without making a purchase.
  - After speaking with the abrasive doctor, I decided to look for a friendlier physician.
  - The player was fined for using abrasive language during the game.



* [[https://wordsinasentence.com/abreast-in-a-sentence/][Abreast]]

  =remaining up to date on a topic=

  - To stay relevant in the field of computer programming, Kurt must stay abreast of the latest programming languages.
  - My teacher gives extra credit to students who stay abreast of world issues by sharing newspaper articles with the class.
  - Before the big match, the team will stay abreast of its opponent's scoring strategies by watching game tapes.
  - I often go online to keep abreast of what my favorite celebrities are doing.



* [[https://wordsinasentence.com/abridge-in-a-sentence/][Abridge]]

  =to make shorter=

  - His agent told him that he needed to abridge some of the content of his novel so that it would be under 400 pages.
  - Scott and Hillary agreed to abridge their story, leaving out some of the more frightening details so that their parents wouldn’t be worried about them.
  - When immigrants enter the county through illegal means, they find that the people in charge not only abridge their basic human rights, but they completely remove them.
  - Editors of some classic literature seem to take a lot of liberties when they abridge the content so that people with lower reading levels can understand what they’re reading.
  - If you abridge your testimony to include only the most important details, I think the jury will be more sympathetic to your case.
  - Even though the translation of the material is complete, you still need to abridge the amount of information so that it doesn’t overwhelm the students.
  - Despite Jerry’s efforts to abridge the amount of time he spends at the office, his friends always know where to find him when he’s not at home.



* [[https://wordsinasentence.com/abstruse-in-a-sentence/][Abstruse]]

  =difficult to understand=

  - Some of the classic novels are too abstruse for beginning readers to understand.
  - Because I am not a computer programmer, I find most programming languages abstruse.
  - Most of the medical research on the subject seems abstruse to the average man.
  - While I could understand a little of the contract, the majority of the legal text was abstruse to me.
  - If you come across a term which is abstruse, you can always use a dictionary to review the word’s meaning.
  - I found the politician’s argument for gun control abstruse and confusing.
  - Because the assembly instructions were abstruse, I was unable to put the shelf together.



* [[https://wordsinasentence.com/abut/][Abut]]

  =to touch or lean on=

  - The chair abuts the wall because it is missing a leg and cannot stand up otherwise, though sitting in it is still risky.
  - The car now abuts the wall of the tunnel, having flipped and rolled after its horrendous crash with an oncoming SUV.
  - If your legs are tired, feel free to abut any nearby wall to gain some support for your legs and your back.
  - While the mighty oak tree in our backyard once stood tall, a bolt of lightning knocked it over, and it now abuts the roof of our home.



* [[https://wordsinasentence.com/accede-in-a-sentence/][Accede]]

  =to agree with someone or give in to his or her wish=

  - At your insistence and to avoid a prolonged argument, I will accede to your contract terms.
  - The company president made a wise decision to accede to consumer pressure and lower the prices of his goods.
  - Perhaps the congressmen should accede to the president’s demands so the budget crisis can be averted.
  - Because Jack wants to make his wife happy on their anniversary, he will accede to wear a tuxedo for their dinner date.
  - Unless management is willing to accede to the employees’ demands, then the bakery will close indefinitely.
  - It would be a wonderful world if all countries would destroy their atomic resources and accede to a ban on nuclear weapons.
  - While the military commander is unable to accede to his troop’s request for a forty-eight hour leave, he can give them a twenty-four hour leave for rest and recuperation.



* [[https://wordsinasentence.com/accredit-in-a-sentence/][Accredit]]

  =to bestow official approval upon=

  - During the ceremony, the dean will accredit students who met the graduation requirements.
  - The federal school council will not accredit any academic program that does not meet its standards.
  - Before the board of pharmacy technicians will accredit you as a medical professional, you must pass its exam.
  - The medical association will not accredit the student who cheated on the national physician’s   assessment.



