ruby/A.html



<div id="outline-container-org839b5af" class="outline-2">
<h2 id="org839b5af"><span class="section-number-2">2</span> <a href="https://wordsinasentence.com/abeyance-in-a-sentence/">Abeyance</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>a state of temporary disuse or suspension</code>
</p>

<ul class="org-ul">
<li>Immediately following the terrorist attack, pilots had to observe a period of abeyance where they could not depart from the airport.</li>
<li>Once the famine was over, the food rationing dictated by the government was put in abeyance.</li>
<li>Until after the murder trial, the inheritance will be placed in abeyance.</li>
<li>Trading on the stock market has temporarily been put in abeyance while the trade commission investigates financial misdeeds.</li>
<li>Because of Justin’s helpful testimony, the judge agreed to an abeyance of his sentence.</li>
<li>Near the end of the legislative session, the congressmen put several topics of discussion on abeyance until the next meeting.</li>
<li>Since the divorcing couple was unable to agree on a financial settlement, the judge placed the case in abeyance until an agreement could be reached.</li>
</ul>
</div>
</div>



<div id="outline-container-orga216e7a" class="outline-2">
<h2 id="orga216e7a"><span class="section-number-2">3</span> <a href="https://wordsinasentence.com/ablaze-in-a-sentence/">Ablaze</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>burning fiercely; in a blaze; on fire</code>
</p>

<ul class="org-ul">
<li>The cops threw Jack to the ground and arrested him after he set the American flag ablaze.</li>
<li>Before fleeing, the bandit set the home ablaze so that any possible evidence would be obliterated.</li>
<li>Eyes ablaze, the man with the black hat reached for his revolver and aimed it at Bob’s head.</li>
<li>After shooting the captive in the head, the terrorist doused Chris’s body with gasoline and set it ablaze.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb5fb638" class="outline-2">
<h2 id="orgb5fb638"><span class="section-number-2">4</span> <a href="https://wordsinasentence.com/abrasive-in-a-sentence/">Abrasive</a></h2>
<div class="outline-text-2" id="text-4">
<p>
<code>unlikeable; nasty</code>
</p>

<ul class="org-ul">
<li>Because of Kurt’s abrasive personality, most people try to avoid him at work.</li>
<li>The clerk was so abrasive to me I walked out the store without making a purchase.</li>
<li>After speaking with the abrasive doctor, I decided to look for a friendlier physician.</li>
<li>The player was fined for using abrasive language during the game.</li>
</ul>
</div>
</div>



<div id="outline-container-org0e14247" class="outline-2">
<h2 id="org0e14247"><span class="section-number-2">5</span> <a href="https://wordsinasentence.com/abreast-in-a-sentence/">Abreast</a></h2>
<div class="outline-text-2" id="text-5">
<p>
<code>remaining up to date on a topic</code>
</p>

<ul class="org-ul">
<li>To stay relevant in the field of computer programming, Kurt must stay abreast of the latest programming languages.</li>
<li>My teacher gives extra credit to students who stay abreast of world issues by sharing newspaper articles with the class.</li>
<li>Before the big match, the team will stay abreast of its opponent's scoring strategies by watching game tapes.</li>
<li>I often go online to keep abreast of what my favorite celebrities are doing.</li>
</ul>
</div>
</div>



<div id="outline-container-org2597dbe" class="outline-2">
<h2 id="org2597dbe"><span class="section-number-2">6</span> <a href="https://wordsinasentence.com/abridge-in-a-sentence/">Abridge</a></h2>
<div class="outline-text-2" id="text-6">
<p>
<code>to make shorter</code>
</p>

<ul class="org-ul">
<li>His agent told him that he needed to abridge some of the content of his novel so that it would be under 400 pages.</li>
<li>Scott and Hillary agreed to abridge their story, leaving out some of the more frightening details so that their parents wouldn’t be worried about them.</li>
<li>When immigrants enter the county through illegal means, they find that the people in charge not only abridge their basic human rights, but they completely remove them.</li>
<li>Editors of some classic literature seem to take a lot of liberties when they abridge the content so that people with lower reading levels can understand what they’re reading.</li>
<li>If you abridge your testimony to include only the most important details, I think the jury will be more sympathetic to your case.</li>
<li>Even though the translation of the material is complete, you still need to abridge the amount of information so that it doesn’t overwhelm the students.</li>
<li>Despite Jerry’s efforts to abridge the amount of time he spends at the office, his friends always know where to find him when he’s not at home.</li>
</ul>
</div>
</div>



<div id="outline-container-orgc72f50b" class="outline-2">
<h2 id="orgc72f50b"><span class="section-number-2">7</span> <a href="https://wordsinasentence.com/abstruse-in-a-sentence/">Abstruse</a></h2>
<div class="outline-text-2" id="text-7">
<p>
<code>difficult to understand</code>
</p>

<ul class="org-ul">
<li>Some of the classic novels are too abstruse for beginning readers to understand.</li>
<li>Because I am not a computer programmer, I find most programming languages abstruse.</li>
<li>Most of the medical research on the subject seems abstruse to the average man.</li>
<li>While I could understand a little of the contract, the majority of the legal text was abstruse to me.</li>
<li>If you come across a term which is abstruse, you can always use a dictionary to review the word’s meaning.</li>
<li>I found the politician’s argument for gun control abstruse and confusing.</li>
<li>Because the assembly instructions were abstruse, I was unable to put the shelf together.</li>
</ul>
</div>
</div>



<div id="outline-container-org9f3eb5d" class="outline-2">
<h2 id="org9f3eb5d"><span class="section-number-2">8</span> <a href="https://wordsinasentence.com/abut/">Abut</a></h2>
<div class="outline-text-2" id="text-8">
<p>
<code>to touch or lean on</code>
</p>

<ul class="org-ul">
<li>The chair abuts the wall because it is missing a leg and cannot stand up otherwise, though sitting in it is still risky.</li>
<li>The car now abuts the wall of the tunnel, having flipped and rolled after its horrendous crash with an oncoming SUV.</li>
<li>If your legs are tired, feel free to abut any nearby wall to gain some support for your legs and your back.</li>
<li>While the mighty oak tree in our backyard once stood tall, a bolt of lightning knocked it over, and it now abuts the roof of our home.</li>
</ul>
</div>
</div>



<div id="outline-container-orgff6265c" class="outline-2">
<h2 id="orgff6265c"><span class="section-number-2">9</span> <a href="https://wordsinasentence.com/accede-in-a-sentence/">Accede</a></h2>
<div class="outline-text-2" id="text-9">
<p>
<code>to agree with someone or give in to his or her wish</code>
</p>

<ul class="org-ul">
<li>At your insistence and to avoid a prolonged argument, I will accede to your contract terms.</li>
<li>The company president made a wise decision to accede to consumer pressure and lower the prices of his goods.</li>
<li>Perhaps the congressmen should accede to the president’s demands so the budget crisis can be averted.</li>
<li>Because Jack wants to make his wife happy on their anniversary, he will accede to wear a tuxedo for their dinner date.</li>
<li>Unless management is willing to accede to the employees’ demands, then the bakery will close indefinitely.</li>
<li>It would be a wonderful world if all countries would destroy their atomic resources and accede to a ban on nuclear weapons.</li>
<li>While the military commander is unable to accede to his troop’s request for a forty-eight hour leave, he can give them a twenty-four hour leave for rest and recuperation.</li>
</ul>
</div>
</div>



<div id="outline-container-org4586343" class="outline-2">
<h2 id="org4586343"><span class="section-number-2">10</span> <a href="https://wordsinasentence.com/accredit-in-a-sentence/">Accredit</a></h2>
<div class="outline-text-2" id="text-10">
<p>
<code>to bestow official approval upon</code>
</p>

<ul class="org-ul">
<li>During the ceremony, the dean will accredit students who met the graduation requirements.</li>
<li>The federal school council will not accredit any academic program that does not meet its standards.</li>
<li>Before the board of pharmacy technicians will accredit you as a medical professional, you must pass its exam.</li>
<li>The medical association will not accredit the student who cheated on the national physician’s   assessment.</li>
</ul>
</div>
</div>
