ruby/A.org
* [[https://wordsinasentence.com/adament-in-a-sentence/][Adamant]]

  =refusing to be persuaded; cannot change one's mind=

  - Robert, a first year physics student, is adamant in his decision to peruse a career in engineering.
  - He is so adamant in his beliefs that no one can change his mind!
  - Unemployed residents are adamant about finding job openings.
  - Mom, why are you adamant about me going to school everyday?
  - The criminal begged for probation, but the judge remained adamant for a life sentence.
  - Please honey, I am adamant for the truth.
  - Adamant about winning next year's 10K race, Laura followed a strict training plan.



* [[https://wordsinasentence.com/admonish-in-a-sentence/][Admonish]]

  =to scold; to warn strongly=

  - Do not admonish him for being gay!
  - I hope my boss does not admonish me for being late.
  - Cops can admonish anyone who goes over the speed limit.
  - Stewart is going to admonish the restaurant for poor customer service.
  - My drama teacher would admonish students for repeatedly forgetting the lines.
  - Admonish Kimberly for leaving crumbs all over the place!
  - How am I not going to admonish you for misbehaving at school?



* [[https://wordsinasentence.com/adumbrate-in-a-sentence/][Adumbrate]]

  =to create an outline or a faint shadow=

  - With assistance from the victim, the sketch artist will adumbrate a picture of the robbery suspect.
  - The artist chose colors to adumbrate the trees in the forest so they would seem mysterious and shadowy.
  - When my mother lit the candle in the darkness, it was nice to see the light adumbrate our shadows on the wall.
  - The photographer dimmed the light so it would adumbrate the model and surround her with shadows.
  - When the sun rises, it will adumbrate the bridge and create a great photo opportunity.
  - James will adumbrate his character ideas so the animator will know how to bring his cartoon to life.
  - As the flashlight batteries grow weaker, the light will only adumbrate a dim glow.



* [[https://wordsinasentence.com/afflicted-in-a-sentence/][Afflicted]]

  =stricken, distressed, or impaired=

  - The man was afflicted with a painful snake bite after a hike on the mountain.
  - Because he was afflicted with arthritis, he had a difficult time walking long distances.
  - Knowing that his grandmother was afflicted with inoperable tumors, he wanted to visit her in hospice.
  - Those afflicted with the flu were receiving an antiviral treatment.



* [[https://wordsinasentence.com/affront-in-a-sentence/][Affront]]

  =to do or say something that shows a lack of respect=

  - The crooked cop is an affront to all that is good about law enforcement.
  - By not bowing to the queen, you have shown an affront to the entire royal family.
  - The monks considered the loud party next door to be an affront to their religious beliefs.
  - Because the old man considers children walking through his yard to be a personal affront, he often calls the police during the summer months.
  - The teacher took it as an affront when the rebellious student threw a piece of trash at her.
  - Although I am not opposed to the production of rated R movies, I would consider watching one to be an affront to my religious values.
  - The minorities at the event took the racist symbol as an affront to their ethnic backgrounds.



* [[https://wordsinasentence.com/aggrandize-in-a-sentence/][Aggrandize]]

  =make great or greater in power, rank, honor, or wealth; increase=

  - I attempted to aggrandize the CEO’s high status in the company to *sweet talk* =花言巧语= him into signing off on the deal.
  - Jack is a philanthropist who only supports causes that aggrandize him in the eyes of the world.
  - I hate listening to that snobbish radio talk show host self-aggrandize.
  - My uncle claims that those that aggrandize their status in the eyes of others end up losing whatever it is that they have.



* [[https://wordsinasentence.com/aghast-in-a-sentence/][Aghast]]

  =shocked or surprised in an upsetting way=

  - The teacher was aghast at the large number of students who failed the easy test.
  - When the magician did his disappearing trick, the speechless audience was aghast.
  - Helen was aghast when she found the illegal drugs buried in her backyard.
  - As the car moved rapidly towards me, I was aghast and could not move to safety.
  - The thought of the federal government monitoring religious activities leaves many aghast.
  - I was so aghast when my favorite celebrity walked passed me that I could not speak.
  - While my friends thought the fake spider was funny, the plastic creature left me aghast and in tears.



* [[https://wordsinasentence.com/agoraphobia-in-a-sentence/][Agoraphobia]]

  =the fear of wide open spaces, crowds, or uncontrolled social conditions=

  - Even the big deals on Black Friday could bring out even those people who suffer from agoraphobia, but the large groups of people could cause them to have anxiety attacks.
  - While being bumped around in the crowds, the man had to leave due to his agoraphobia.
  - Even if you don’t suffer from agoraphobia, you may still have problems with walking in shopping malls on the day after Thanksgiving.
  - Someone who has agoraphobia should stay away from Walmart on Saturday mornings.



* [[https://wordsinasentence.com/allegiance-in-a-sentence/][Allegiance]]

  =loyalty to some cause, nation or ruler=

  - Standing opposite the flag, I placed my right hand on my heart to recite the pledge of allegiance.
  - Max’s feelings of allegiance will always rest with England, because he was born there.
  - We took an oath of allegiance upon entering the military, and none of us plan on violating it.
  - Having lived in Denver for most of my adult life, the Broncos have now captured my allegiance.



* [[https://wordsinasentence.com/allegory-in-a-sentence/][Allegory]]

  =a representation or story in which personalities and incidents act as symbols depicting beliefs related to human beings or specific situations=

  - Yesterday, Sister Agnes told us a religious allegory that explained why telling falsehoods is unacceptable.
  - The classic book is based on a famous allegory that describes the pitfalls of arrogance.
  - In the poem, the writer used an allegory to explain his personal feelings about love.
  - The novel is basically an allegory in which animals represent humans associated with corporate greed.



