ruby/A.html



<div id="outline-container-org5e25c7d" class="outline-2">
<h2 id="org5e25c7d"><span class="section-number-2">11</span> <a href="https://wordsinasentence.com/adament-in-a-sentence/">Adamant</a></h2>
<div class="outline-text-2" id="text-11">
<p>
<code>refusing to be persuaded; cannot change one's mind</code>
</p>

<ul class="org-ul">
<li>Robert, a first year physics student, is adamant in his decision to peruse a career in engineering.</li>
<li>He is so adamant in his beliefs that no one can change his mind!</li>
<li>Unemployed residents are adamant about finding job openings.</li>
<li>Mom, why are you adamant about me going to school everyday?</li>
<li>The criminal begged for probation, but the judge remained adamant for a life sentence.</li>
<li>Please honey, I am adamant for the truth.</li>
<li>Adamant about winning next year's 10K race, Laura followed a strict training plan.</li>
</ul>
</div>
</div>



<div id="outline-container-org0c00768" class="outline-2">
<h2 id="org0c00768"><span class="section-number-2">12</span> <a href="https://wordsinasentence.com/admonish-in-a-sentence/">Admonish</a></h2>
<div class="outline-text-2" id="text-12">
<p>
<code>to scold; to warn strongly</code>
</p>

<ul class="org-ul">
<li>Do not admonish him for being gay!</li>
<li>I hope my boss does not admonish me for being late.</li>
<li>Cops can admonish anyone who goes over the speed limit.</li>
<li>Stewart is going to admonish the restaurant for poor customer service.</li>
<li>My drama teacher would admonish students for repeatedly forgetting the lines.</li>
<li>Admonish Kimberly for leaving crumbs all over the place!</li>
<li>How am I not going to admonish you for misbehaving at school?</li>
</ul>
</div>
</div>



<div id="outline-container-org283fea0" class="outline-2">
<h2 id="org283fea0"><span class="section-number-2">13</span> <a href="https://wordsinasentence.com/adumbrate-in-a-sentence/">Adumbrate</a></h2>
<div class="outline-text-2" id="text-13">
<p>
<code>to create an outline or a faint shadow</code>
</p>

<ul class="org-ul">
<li>With assistance from the victim, the sketch artist will adumbrate a picture of the robbery suspect.</li>
<li>The artist chose colors to adumbrate the trees in the forest so they would seem mysterious and shadowy.</li>
<li>When my mother lit the candle in the darkness, it was nice to see the light adumbrate our shadows on the wall.</li>
<li>The photographer dimmed the light so it would adumbrate the model and surround her with shadows.</li>
<li>When the sun rises, it will adumbrate the bridge and create a great photo opportunity.</li>
<li>James will adumbrate his character ideas so the animator will know how to bring his cartoon to life.</li>
<li>As the flashlight batteries grow weaker, the light will only adumbrate a dim glow.</li>
</ul>
</div>
</div>



<div id="outline-container-org74bcfc0" class="outline-2">
<h2 id="org74bcfc0"><span class="section-number-2">14</span> <a href="https://wordsinasentence.com/afflicted-in-a-sentence/">Afflicted</a></h2>
<div class="outline-text-2" id="text-14">
<p>
<code>stricken, distressed, or impaired</code>
</p>

<ul class="org-ul">
<li>The man was afflicted with a painful snake bite after a hike on the mountain.</li>
<li>Because he was afflicted with arthritis, he had a difficult time walking long distances.</li>
<li>Knowing that his grandmother was afflicted with inoperable tumors, he wanted to visit her in hospice.</li>
<li>Those afflicted with the flu were receiving an antiviral treatment.</li>
</ul>
</div>
</div>



<div id="outline-container-org63769f8" class="outline-2">
<h2 id="org63769f8"><span class="section-number-2">15</span> <a href="https://wordsinasentence.com/affront-in-a-sentence/">Affront</a></h2>
<div class="outline-text-2" id="text-15">
<p>
<code>to do or say something that shows a lack of respect</code>
</p>

<ul class="org-ul">
<li>The crooked cop is an affront to all that is good about law enforcement.</li>
<li>By not bowing to the queen, you have shown an affront to the entire royal family.</li>
<li>The monks considered the loud party next door to be an affront to their religious beliefs.</li>
<li>Because the old man considers children walking through his yard to be a personal affront, he often calls the police during the summer months.</li>
<li>The teacher took it as an affront when the rebellious student threw a piece of trash at her.</li>
<li>Although I am not opposed to the production of rated R movies, I would consider watching one to be an affront to my religious values.</li>
<li>The minorities at the event took the racist symbol as an affront to their ethnic backgrounds.</li>
</ul>
</div>
</div>



<div id="outline-container-org166fb2b" class="outline-2">
<h2 id="org166fb2b"><span class="section-number-2">16</span> <a href="https://wordsinasentence.com/aggrandize-in-a-sentence/">Aggrandize</a></h2>
<div class="outline-text-2" id="text-16">
<p>
<code>make great or greater in power, rank, honor, or wealth; increase</code>
</p>

<ul class="org-ul">
<li>I attempted to aggrandize the CEO’s high status in the company to sweet talk him into signing off on the deal.</li>
<li>Jack is a philanthropist who only supports causes that aggrandize him in the eyes of the world.</li>
<li>I hate listening to that snobbish radio talk show host self-aggrandize.</li>
<li>My uncle claims that those that aggrandize their status in the eyes of others end up losing whatever it is that they have.</li>
</ul>
</div>
</div>



<div id="outline-container-org72e442b" class="outline-2">
<h2 id="org72e442b"><span class="section-number-2">17</span> <a href="https://wordsinasentence.com/aghast-in-a-sentence/">Aghast</a></h2>
<div class="outline-text-2" id="text-17">
<p>
<code>shocked or surprised in an upsetting way</code>
</p>

<ul class="org-ul">
<li>The teacher was aghast at the large number of students who failed the easy test.</li>
<li>When the magician did his disappearing trick, the speechless audience was aghast.</li>
<li>Helen was aghast when she found the illegal drugs buried in her backyard.</li>
<li>As the car moved rapidly towards me, I was aghast and could not move to safety.</li>
<li>The thought of the federal government monitoring religious activities leaves many aghast.</li>
<li>I was so aghast when my favorite celebrity walked passed me that I could not speak.</li>
<li>While my friends thought the fake spider was funny, the plastic creature left me aghast and in tears.</li>
</ul>
</div>
</div>



<div id="outline-container-org70d8d3a" class="outline-2">
<h2 id="org70d8d3a"><span class="section-number-2">18</span> <a href="https://wordsinasentence.com/agoraphobia-in-a-sentence/">Agoraphobia</a></h2>
<div class="outline-text-2" id="text-18">
<p>
<code>the fear of wide open spaces, crowds, or uncontrolled social conditions</code>
</p>

<ul class="org-ul">
<li>Even the big deals on Black Friday could bring out even those people who suffer from agoraphobia, but the large groups of people could cause them to have anxiety attacks.</li>
<li>While being bumped around in the crowds, the man had to leave due to his agoraphobia.</li>
<li>Even if you don’t suffer from agoraphobia, you may still have problems with walking in shopping malls on the day after Thanksgiving.</li>
<li>Someone who has agoraphobia should stay away from Walmart on Saturday mornings.</li>
</ul>
</div>
</div>



<div id="outline-container-org63c6518" class="outline-2">
<h2 id="org63c6518"><span class="section-number-2">19</span> <a href="https://wordsinasentence.com/allegiance-in-a-sentence/">Allegiance</a></h2>
<div class="outline-text-2" id="text-19">
<p>
<code>loyalty to some cause, nation or ruler</code>
</p>

<ul class="org-ul">
<li>Standing opposite the flag, I placed my right hand on my heart to recite the pledge of allegiance.</li>
<li>Max’s feelings of allegiance will always rest with England, because he was born there.</li>
<li>We took an oath of allegiance upon entering the military, and none of us plan on violating it.</li>
<li>Having lived in Denver for most of my adult life, the Broncos have now captured my allegiance.</li>
</ul>
</div>
</div>



<div id="outline-container-orga34970d" class="outline-2">
<h2 id="orga34970d"><span class="section-number-2">20</span> <a href="https://wordsinasentence.com/allegory-in-a-sentence/">Allegory</a></h2>
<div class="outline-text-2" id="text-20">
<p>
<code>a representation or story in which personalities and incidents act as symbols depicting beliefs related to human beings or specific situations</code>
</p>

<ul class="org-ul">
<li>Yesterday, Sister Agnes told us a religious allegory that explained why telling falsehoods is unacceptable.</li>
<li>The classic book is based on a famous allegory that describes the pitfalls of arrogance.</li>
<li>In the poem, the writer used an allegory to explain his personal feelings about love.</li>
<li>The novel is basically an allegory in which animals represent humans associated with corporate greed.</li>
</ul>
</div>
</div>
