ruby/A.org
* [[https://wordsinasentence.com/anaerobic-in-a-sentence/][Anaerobic]]

  =existing without oxygen=

  - While aerobic organisms need oxygen to survive, anaerobic creatures survive without the element.
  - The bacteria is anaerobic, and as such, does not require the presence of oxygen to thrive.
  - Despite what you may have heard, fish are not anaerobic; they need oxygen to breathe.
  - Humans are not anaerobic because they require oxygen in order to live.



* [[https://wordsinasentence.com/anathema-meaning-in-a-sentence/][Anathema]]

  =something or someone that one strongly dislikes; someone who is cursed or shunned=

  - After the world learned of his heinous crimes, the dictator was considered an anathema.
  - The epidemic which killed dozens of small children was an anathema to the residents of the town.
  - While he presented himself as a godly man, the priest committed several unethical acts that made him an anathema to members of his congregation.
  - The children hate wearing uniforms to school and view the dress code as an anathema.
  - Since the beginning of time, blind faith has been an anathema to science.
  - The amount of money celebrities spend on clothing and jewelry is anathema to most poor people.
  - Because my daughter hates the taste of broccoli, she considers it to be an anathema.



* [[https://wordsinasentence.com/angular-in-a-sentence/][Angular]]

  =so thin or skinny that one’s bones can be seen=

  - The angular boy was so thin you could see his *rib cage*.
  - When the doctor saw the angular teen, he knew she wasn’t eating properly.
  - People call my uncle “Toothpick” because of his angular form.
  - Although Jenny is an adult, she shops in children’s stores to find clothes that fit her angular frame.



* [[https://wordsinasentence.com/animosity-in-a-sentence/][Animosity]]

  =a strong feeling of disliking someone or something=

  - Why do you have such animosity towards me when I have done nothing to you?
  - During the match, the animosity between the two wrestlers was obvious.
  - Because Ellen’s father used to lock her in the basement, she has a lot of animosity towards him today.
  - My animosity for Cliff is so great that I cannot stand to be around him.
  - Ernest displayed his animosity towards his competitors by refusing to acknowledge them.
  - Use your energy to spread love not animosity!
  - Although I was very angry with my sister yesterday, I bear no animosity towards her today.



* [[https://wordsinasentence.com/anomalous-in-a-sentence/][Anomalous]]

  =unordinary, unusual, or distinctly different from the norm=

  - The scientists at the weather station were extremely worried about the anomalous readings they were getting from their instruments, as they were far beyond the norm.
  - My sister was pretending to act normal after breaking up with her boyfriend, but her anomalous activities that strayed from the routine proved she was just faking it.
  - Being struck by lightning is actually a rather anomalous event, since the chances of being struck by lightning are so astronomically low.
  - On Opposite Day, everyone behaves in an anomalous fashion, usually the exact opposite of how they would normally behave.



* [[https://wordsinasentence.com/antagonize-in-a-sentence/][Antagonize]]

  =to trigger hostility or anger=

  - If you antagonize the dog, he will bite you.
  - The man made a huge mistake when he decided to antagonize the bees in his yard.
  - By agreeing with the remarks of the pro-abortion group, the politician seems to be going out of his way to antagonize Christian voters.
  - Since John was already irritated, his wife knew it would not take much to antagonize him.



* [[https://wordsinasentence.com/anticlimactic-in-a-sentence/][Anticlimactic]]

  =lacking climax, disappointing or ironically insignificant following of impressive foreshadowing=

  - Although the child anticipated that the gift would bring him endless enjoyment, it quickly turned into an anticlimactic experience.
  - Mom claims that an accurate view on life prevents anticlimactic results, as we would not overvalue things.
  - Despite all of the hype, the game turned out to be boring, uneventful and overwhelmingly anticlimactic.
  - The news that our CEO was stepping down came as a surprise, but turned out to be anticlimactic compared to what happened next.



* [[https://wordsinasentence.com/antithesis-in-a-sentence/][Antithesis]]

  =the total opposite of an object or person=

  - In the movie, Robert’s character of an abusive husband is the antithesis of the caring spouse the actor really is.
  - Although the hotel describes itself as a five-star resort, in reality its decrepit building is the antithesis of a fine hotel.
  - The heroine’s death was the antithesis of what I thought would happen at the end of the novel.
  - During his sermon, the minister asked his clergy members to practice the antithesis of hate and love even their worst enemies.
  - A violent criminal is the antithesis of a well-behaved adult.
  - In writing, an antithesis is a device used to show contrast between two unlike objects or individuals.
  - It goes without saying that freedom is the antithesis of captivity.



* [[https://wordsinasentence.com/apathetic-in-a-sentence/][Apathetic]]

  =having little or no interest or concern=

  - The employee’s apathetic attitude was apparent in the rude way he greeted customers.
  - Because the diva thought she was better than everyone else, she was apathetic about having others wait on her.
  - Although James was apathetic about his classes, he loved playing football.
  - To get on the jury, you will need to be apathetic about the murder.
  - Because Jane was apathetic about completing her schoolwork, she did not graduate on time.
  - Sometimes it seems as though we live in an apathetic world filled with uncaring people.
  - How can you be so apathetic about the war when people are dying in battle every minute?



* [[https://wordsinasentence.com/aphorism-in-a-sentence/][Aphorism]]

  =a brief and witty saying=

  - While Ted’s aphorism was short and funny, it was enough to make us briefly forget our father was having life-saving surgery.
  - Bill began his speech with a humorous aphorism from one of his favorite authors.
  - When Jack made his wedding toast, he included a marital aphorism that made everyone in the room laugh.
  - The popular aphorism gives advice in a manner that is both witty and concise.



