ruby/A.html



<div id="outline-container-org1fbe722" class="outline-2">
<h2 id="org1fbe722"><span class="section-number-2">30</span> <a href="https://wordsinasentence.com/anaerobic-in-a-sentence/">Anaerobic</a></h2>
<div class="outline-text-2" id="text-30">
<p>
<code>existing without oxygen</code>
</p>

<ul class="org-ul">
<li>While aerobic organisms need oxygen to survive, anaerobic creatures survive without the element.</li>
<li>The bacteria is anaerobic, and as such, does not require the presence of oxygen to thrive.</li>
<li>Despite what you may have heard, fish are not anaerobic; they need oxygen to breathe.</li>
<li>Humans are not anaerobic because they require oxygen in order to live.</li>
</ul>
</div>
</div>



<div id="outline-container-org878ca0e" class="outline-2">
<h2 id="org878ca0e"><span class="section-number-2">31</span> <a href="https://wordsinasentence.com/anathema-meaning-in-a-sentence/">Anathema</a></h2>
<div class="outline-text-2" id="text-31">
<p>
<code>something or someone that one strongly dislikes; someone who is cursed or shunned</code>
</p>

<ul class="org-ul">
<li>After the world learned of his heinous crimes, the dictator was considered an anathema.</li>
<li>The epidemic which killed dozens of small children was an anathema to the residents of the town.</li>
<li>While he presented himself as a godly man, the priest committed several unethical acts that made him an anathema to members of his congregation.</li>
<li>The children hate wearing uniforms to school and view the dress code as an anathema.</li>
<li>Since the beginning of time, blind faith has been an anathema to science.</li>
<li>The amount of money celebrities spend on clothing and jewelry is anathema to most poor people.</li>
<li>Because my daughter hates the taste of broccoli, she considers it to be an anathema.</li>
</ul>
</div>
</div>



<div id="outline-container-orgf48b4c7" class="outline-2">
<h2 id="orgf48b4c7"><span class="section-number-2">32</span> <a href="https://wordsinasentence.com/angular-in-a-sentence/">Angular</a></h2>
<div class="outline-text-2" id="text-32">
<p>
<code>so thin or skinny that one’s bones can be seen</code>
</p>

<ul class="org-ul">
<li>The angular boy was so thin you could see his rib cage.</li>
<li>When the doctor saw the angular teen, he knew she wasn’t eating properly.</li>
<li>People call my uncle “Toothpick” because of his angular form.</li>
<li>Although Jenny is an adult, she shops in children’s stores to find clothes that fit her angular frame.</li>
</ul>
</div>
</div>



<div id="outline-container-org70fa481" class="outline-2">
<h2 id="org70fa481"><span class="section-number-2">33</span> <a href="https://wordsinasentence.com/animosity-in-a-sentence/">Animosity</a></h2>
<div class="outline-text-2" id="text-33">
<p>
<code>a strong feeling of disliking someone or something</code>
</p>

<ul class="org-ul">
<li>Why do you have such animosity towards me when I have done nothing to you?</li>
<li>During the match, the animosity between the two wrestlers was obvious.</li>
<li>Because Ellen’s father used to lock her in the basement, she has a lot of animosity towards him today.</li>
<li>My animosity for Cliff is so great that I cannot stand to be around him.</li>
<li>Ernest displayed his animosity towards his competitors by refusing to acknowledge them.</li>
<li>Use your energy to spread love not animosity!</li>
<li>Although I was very angry with my sister yesterday, I bear no animosity towards her today.</li>
</ul>
</div>
</div>



<div id="outline-container-org4fcec1b" class="outline-2">
<h2 id="org4fcec1b"><span class="section-number-2">34</span> <a href="https://wordsinasentence.com/anomalous-in-a-sentence/">Anomalous</a></h2>
<div class="outline-text-2" id="text-34">
<p>
<code>unordinary, unusual, or distinctly different from the norm</code>
</p>

<ul class="org-ul">
<li>The scientists at the weather station were extremely worried about the anomalous readings they were getting from their instruments, as they were far beyond the norm.</li>
<li>My sister was pretending to act normal after breaking up with her boyfriend, but her anomalous activities that strayed from the routine proved she was just faking it.</li>
<li>Being struck by lightning is actually a rather anomalous event, since the chances of being struck by lightning are so astronomically low.</li>
<li>On Opposite Day, everyone behaves in an anomalous fashion, usually the exact opposite of how they would normally behave.</li>
</ul>
</div>
</div>



<div id="outline-container-orge2e50a7" class="outline-2">
<h2 id="orge2e50a7"><span class="section-number-2">35</span> <a href="https://wordsinasentence.com/antagonize-in-a-sentence/">Antagonize</a></h2>
<div class="outline-text-2" id="text-35">
<p>
<code>to trigger hostility or anger</code>
</p>

<ul class="org-ul">
<li>If you antagonize the dog, he will bite you.</li>
<li>The man made a huge mistake when he decided to antagonize the bees in his yard.</li>
<li>By agreeing with the remarks of the pro-abortion group, the politician seems to be going out of his way to antagonize Christian voters.</li>
<li>Since John was already irritated, his wife knew it would not take much to antagonize him.</li>
</ul>
</div>
</div>



<div id="outline-container-org8bb3851" class="outline-2">
<h2 id="org8bb3851"><span class="section-number-2">36</span> <a href="https://wordsinasentence.com/anticlimactic-in-a-sentence/">Anticlimactic</a></h2>
<div class="outline-text-2" id="text-36">
<p>
<code>lacking climax, disappointing or ironically insignificant following of impressive foreshadowing</code>
</p>

<ul class="org-ul">
<li>Although the child anticipated that the gift would bring him endless enjoyment, it quickly turned into an anticlimactic experience.</li>
<li>Mom claims that an accurate view on life prevents anticlimactic results, as we would not overvalue things.</li>
<li>Despite all of the hype, the game turned out to be boring, uneventful and overwhelmingly anticlimactic.</li>
<li>The news that our CEO was stepping down came as a surprise, but turned out to be anticlimactic compared to what happened next.</li>
</ul>
</div>
</div>



<div id="outline-container-org38ca4fe" class="outline-2">
<h2 id="org38ca4fe"><span class="section-number-2">37</span> <a href="https://wordsinasentence.com/antithesis-in-a-sentence/">Antithesis</a></h2>
<div class="outline-text-2" id="text-37">
<p>
<code>the total opposite of an object or person</code>
</p>

<ul class="org-ul">
<li>In the movie, Robert’s character of an abusive husband is the antithesis of the caring spouse the actor really is.</li>
<li>Although the hotel describes itself as a five-star resort, in reality its decrepit building is the antithesis of a fine hotel.</li>
<li>The heroine’s death was the antithesis of what I thought would happen at the end of the novel.</li>
<li>During his sermon, the minister asked his clergy members to practice the antithesis of hate and love even their worst enemies.</li>
<li>A violent criminal is the antithesis of a well-behaved adult.</li>
<li>In writing, an antithesis is a device used to show contrast between two unlike objects or individuals.</li>
<li>It goes without saying that freedom is the antithesis of captivity.</li>
</ul>
</div>
</div>



<div id="outline-container-org09b48ce" class="outline-2">
<h2 id="org09b48ce"><span class="section-number-2">38</span> <a href="https://wordsinasentence.com/apathetic-in-a-sentence/">Apathetic</a></h2>
<div class="outline-text-2" id="text-38">
<p>
<code>having little or no interest or concern</code>
</p>

<ul class="org-ul">
<li>The employee’s apathetic attitude was apparent in the rude way he greeted customers.</li>
<li>Because the diva thought she was better than everyone else, she was apathetic about having others wait on her.</li>
<li>Although James was apathetic about his classes, he loved playing football.</li>
<li>To get on the jury, you will need to be apathetic about the murder.</li>
<li>Because Jane was apathetic about completing her schoolwork, she did not graduate on time.</li>
<li>Sometimes it seems as though we live in an apathetic world filled with uncaring people.</li>
<li>How can you be so apathetic about the war when people are dying in battle every minute?</li>
</ul>
</div>
</div>



<div id="outline-container-org4db83b7" class="outline-2">
<h2 id="org4db83b7"><span class="section-number-2">39</span> <a href="https://wordsinasentence.com/aphorism-in-a-sentence/">Aphorism</a></h2>
<div class="outline-text-2" id="text-39">
<p>
<code>a brief and witty saying</code>
</p>

<ul class="org-ul">
<li>While Ted’s aphorism was short and funny, it was enough to make us briefly forget our father was having life-saving surgery.</li>
<li>Bill began his speech with a humorous aphorism from one of his favorite authors.</li>
<li>When Jack made his wedding toast, he included a marital aphorism that made everyone in the room laugh.</li>
<li>The popular aphorism gives advice in a manner that is both witty and concise.</li>
</ul>
</div>
</div>
