ruby/A.org
* [[https://wordsinasentence.com/assail-in-a-sentence/][Assail]]

  =to attack violently=

  - If anyone ever talks negatively about Alex’s father, his response is to assail the person with insults.
  - Because *fits of* =一阵阵= sneezing assail me almost year-round, I never go outside without taking an antihistamine.
  - When difficult circumstances assail my tranquility, I turn to meditation.
  - When I was a child, fears of monsters under the bed would assail me if I didn’t keep the light turned on.
  - When Rebecca saw her cousin coming over she knew he was about to assail her friends with embarrassing stories of when they were kids.
  - Whatever you do, don’t assail the integrity of someone else’s research.
  - Anyone who would assail someone’s reputation anonymously is nothing but a coward.



* [[https://wordsinasentence.com/assiduous-in-a-sentence/][Assiduous]]

  =showing hard work and care that is brought about by attention to detail=

  - That was very assiduous of you to finish those financial reports weeks ahead of schedule.
  - With your assiduous attempt at learning Spanish, I think you will master the language in no time.
  - The assiduous students chose to work on their term paper instead of going out to play.
  - With an assiduous attitude, we will finish this project.
  - Even the most assiduous workers had trouble focusing with the roaring of the machines.
  - Rather than *slacking off*, remain assiduous and be amazed at how much you accomplish.
  - Because Jane took assiduous notes, she outperformed every student in the class.



* [[https://wordsinasentence.com/assimilate-in-a-sentence/][Assimilate]]

  =to learn something so that it is fully understood and can be used=

  - Because I am not good with math, I find it difficult to assimilate most of the geometry formulas.
  - Jane had to assimilate a great deal of information on the first day of her new job.
  - Although Janet listens during the class lectures, she still finds it hard to assimilate all the scientific facts.
  - The four-year-old genius could assimilate information quicker than most college students.
  - When Helen moved to Japan, she had to quickly assimilate a new language into her vocabulary.
  - Increasing your vocabulary will make it easier for you to assimilate reading comprehension skills.
  - Because the game’s rules are hard to assimilate, younger children will find it difficult to play.



* [[https://wordsinasentence.com/astute-in-a-sentence/][Astute]]

  =marked by practical hardheaded intelligence=

  - The astute businessman went from rags to riches with one great idea.
  - Not very astute of you running around with a sharp knife.
  - The astute businessman was able to quickly assess the market and make the best buying decision.
  - Because of his astute nature, it is very hard to trick the politician with any gimmick.
  - The astute worker used her meeting with her boss as an opportunity to ask for a promotion.
  - Both of the tricksters were astute and could easily select a mark that would fall for their scam.
  - Holding onto a great idea for ages, the astute man finally submitted his inventive concept that may revolutionize how we strap on our seat belts.



* [[https://wordsinasentence.com/asunder-in-a-sentence/][Asunder]]

  =separate into distinct parts=

  - When I learned my husband had been cheating on me, I felt as though my world had been blown asunder.
  - If the marital crisis tears the couple asunder, who do you think will keep the house?
  - The country has been torn asunder by an internal war that has divided it into a number of self-governing regions.
  - When the killer swung the axe, he ripped the door asunder.
  - The unpopular selection of the cheerleading captain tore the once united squad asunder and into two different groups.
  - During a meeting with the marriage counselor, Jake said harsh words that hurt his wife and cut his marriage asunder.
  - The tiny boat was ripped asunder by the force of the hurricane.



* [[https://wordsinasentence.com/atone-in-a-sentence/][Atone]]

  =to reimburse for a wrongdoing=

  - To atone for racist actions in his youth, the billionaire established a scholarship fund for minority students attending his alma mater.
  - The manager tried to atone for the bad service by offering me a complimentary dessert.
  - When the drug caused the man’s death, the manufacturer tried to atone for its mistake by offering the widow two million dollars.
  - Maggie is trying to atone for her bad behavior last night by acting like an angel today.
  - According to Christians, Jesus died to atone for the sins of all people.
  - The judge decided the only way the criminal could atone for his heinous crimes was by receiving capital punishment.
  - Since Jim has made no plans to atone for his financial crimes, the parole board will probably deny his application for an early release.



* [[https://wordsinasentence.com/atrocity-in-a-sentence/][Atrocity]]

  =a horrific action=

  - The atrocity of the murders stunned the entire city.
  - To death penalty opponents, capital punishment is a huge atrocity.
  - The soldier’s act of atrocity earned him a dishonorable discharge from the military and a fifty-year prison sentence.
  - When the president learned of the dictator’s atrocity, he promised to help remove the cruel leader from power.
  - The murder of the senior citizens showed the disturbed killer would not hesitate to commit an atrocity.
  - At this time, no organization has taken credit for the atrocity that sank the cruise ship.
  - The 911 operator’s drinking problem led to an atrocity that resulted in the deaths of three children.



* [[https://wordsinasentence.com/atrophy-in-a-sentence/][Atrophy]]

  =to weaken in ability or function=

  - It was hard to watch my mother atrophy as she experienced the weakening disease of Alzheimer’s.
  - According to researchers, the lack of exercise causes muscles to atrophy and become feeble.
  - The use of cocaine can impair heart functioning and atrophy brain cells.
  - When Janice stopped practicing the piano, her musical skills started to atrophy.
  - When the gang leader died, his organization’s hold on the city began to atrophy as other gangs moved into the area.
  - Because I have been wearing a boot that keeps my foot immobile, my ankle muscles have started to atrophy from nonuse.
  - The bullet in Jack's head is causing his brain to atrophy.



