ruby/A.org
* [[https://wordsinasentence.com/attest-in-a-sentence/][Attest]]

  =to uphold something as real or true=

  - As any police officer can attest, driving while texting is not safe.
  - The doctor can attest to your medical condition if a work excuse is needed.
  - During the parole hearing, the warden will attest to the inmate’s positive behavior.
  - The prosecutor lost his case when the witness was unable to attest to seeing the defendant at the crime scene.
  - Before the company is audited, we need to hire an accountant to review our finances and attest they are in order.
  - The empty plates on the table attest to the fact my mother is a fantastic cook.
  - Since Helen was with me that evening, I was able to attest to her whereabouts when I was questioned by the police.



* [[https://wordsinasentence.com/attrition-in-a-sentence/][Attrition]]

  =a decrease in the number of staff or personnel as a result of replacements not been hired when employees leave=

  - Police officer attrition is making it difficult for law enforcement to safeguard the entire community.
  - As a result of teacher attrition, a lot of classrooms are overcrowded.
  - The Girl Scout troop’s attrition is sizable because many families have moved out of the neighborhood.
  - Unfortunately, budget cuts are worsening the fire department’s attrition problem.



* [[https://wordsinasentence.com/attune-in-a-sentence/][Attune]]

  =to customize or modify something to be more receptive or capable=

  - The radio transmitter wasn’t picking up what we needed, so I had to attune it to the right frequency.
  - You can attune yourself to any future situation by participating in them more often, as practice at anything will inevitably make you better at it.
  - Many musicians have to attune their instruments before playing to get the exact sound that they want or need.
  - If you want to get the best satellite TV possible, you will have to attune your satellite to the optimal position for receiving broadcasts.



* [[https://wordsinasentence.com/audacious-in-a-sentence/][Audacious]]

  =recklessly bold; daring=

  - Cooper was an audacious soldier who never ran from a battle.
  - Although April is an audacious athlete, she does not participate in any dangerous sports.
  - The millionaire earned his fortune by being an audacious player on the stock market.
  - While Harold’s business plan was risky and audacious, it promised great rewards if successful.
  - Jason was an audacious chess opponent who won nearly every match because of his bold moves.
  - Even though Kim is an audacious driver who rarely drives the speed limit, she has never been in a car accident.
  - The prince’s audacious plan to save the princess included crossing the deathly forest and killing the dragon.



* [[https://wordsinasentence.com/auspices-in-a-sentence/][Auspices]]

  =guidance and support=

  - Under the auspices of their commander-in-chief, the troops crossed the border into the war zone.
  - Two mobile libraries, under the auspices of the state literacy program, regularly visit inner-city communities.
  - Under the auspices of their teacher, the students dissected a pig.
  - Kim is excited about taking the trip with her friends because for once, she’ll be independent and not under the auspices of her parents.



* [[https://wordsinasentence.com/auspicious-in-a-sentence/][Auspicious]]

  =being a sign of future success; indicating a promising future=

  - His brilliant acceptance speech was an auspicious start to his political career.
  - Everybody knows the end of the year is an auspicious time to buy a car!
  - Because everyone was happy and feeling generous at the party, it was an auspicious time to ask for charitable donations.
  - In Chinese culture, the shade of red is considered auspicious so Chinese men often wear red ties to important meetings.
  - Since his father was a state judge, Henry was born with an auspicious legal career ahead of him.
  - After his boss praised him for his work on the big project, Sam felt it was an auspicious time to ask for a promotion.
  - When the president took his oath without missing a word, everyone noted the event as an auspicious occasion.



* [[https://wordsinasentence.com/austere-in-a-sentence/][Austere]]

  =without any decoration; strict and serious in manner=

  - Even though she appeared austere, my teacher was a very kind woman.
  - The soft candlelight made the room’s décor less austere.
  - Lacking personal touches, the couple’s formal living room was quite austere.
  - Although the furnishings in the house were beautifully designed, they were austere in appearance.
  - Instead of being bleak and austere, hospitals should be warm and cheery.
  - When he thought no one was watching, the austere palace guard would smile at the small children.
  - A monk chooses to live an austere life because of his religious beliefs.



* [[https://wordsinasentence.com/avarice-in-a-sentence/][Avarice]]

  =A strong desire and greed for money/material things=

  - Mr. Krab’s avarice for money caused him to work his employees to the bone for little pay.
  - The greedy banker’s avarice led him to funnel company funds into his personal account.
  - With avarice, you could have everything in the world and it all still would not be enough.
  - Motivated by avarice, the employee stole thousands of dollars from the company vault.
  - I cannot believe that your intense avarice gets in the way of donating a measly $5!
  - During the theft trial, evidence was presented to show the greedy defendant’s avarice and gluttony.
  - Her only motivation for suing the wealthy businessman is pure avarice.



* [[https://wordsinasentence.com/avaricious-in-a-sentence/][Avaricious]]

  =desirous of wealth or advancement=

  - Since Tiffany was an avaricious reader, her reading level was at 12th grade level even though she was still in 4th grade.
  - Even though the king had all the riches in his kingdom, this avaricious leader always wanted more.
  - After receiving a bill for millions of dollars, the avaricious lawyer would charge as much as possible to his needy clients.
  - The avaricious student was completing her fourth college degree so that her skills would be well above the other candidates’ skills for any job.



