ruby/A.org
* [[https://wordsinasentence.com/averse-in-a-sentence/][Averse]]

  =actively not liking something=

  - For those who are averse to spaghetti, you also have the meal choice of baked chicken with roasted potatoes.
  - My teenager daughter is averse to chores and usually has to be forced to complete her cleaning duties.
  - Because I am averse to risk, I never play casino games.
  - My children are quite averse to the suggestion of having year-round school.
  - Since my children are averse to broccoli, I have to hide the vegetable in their favorite dishes.
  - Marilyn is averse to conflict and goes out of her way to avoid disagreements.
  - Because we all know Betty is averse to heights, we were shocked when she took up skydiving.



* [[https://wordsinasentence.com/avocation-in-a-sentence/][Avocation]]

  =an activity one enjoys when he or she is not working=

  - Recently, Sherman discovered woodworking is the type of avocation he enjoys in his spare time.
  - In college Josh did not have time for an avocation; he was too busy studying to pursue a hobby.
  - Trisha excelled at the avocation of sewing and ultimately turned it into a career.
  - While John saw stamp collecting as a fun avocation, many people saw it as a boring hobby.



* [[https://wordsinasentence.com/axiom-in-a-sentence/][Axiom]]

  =a rule or principal that many people accept as true=

  - Although you keep using that axiom as the basis for your paper, the concept itself is not true.
  - Mrs. Struthers is an awful teacher who does not believe the axiom that states, "all children can learn".
  - According to the axiom, all men have equal worth.
  - The axiom of it being cheaper by the dozen is not true when it comes to feeding a large family at today’s market prices.
  - The actress with the fewest number of lines found it difficult to accept the axiom about there being no small roles only small actors.
  - When the university disproved the basic axiom of protein replication, the scientific community was shocked and hurried to confirm the new findings.
  - Unfortunately, the dictator runs his country on the axiom "might makes right".



* [[https://wordsinasentence.com/abase-in-a-sentence/][Abase]]

  =to lower so as to hurt feelings=

  - My stepmother is an evil woman who likes to abase little children because she had a miserable childhood herself.
  - Because Mark hated himself, he often tried to abase others by calling them names.
  - I will not remain married to a man who tries to abase me in order to make me feel worthless!
  - Although I need money badly, I will not abase myself by working for pennies.
  - The gossip columnist tried to abase the singer’s reputation by spreading lies about him.
  - Even though John was angry at his wife for losing a thousand dollars, he chose not to abase her with cruel words.
  - Although Alice bullies smaller kids at school, she does not abase her younger brother at home.



* [[https://wordsinasentence.com/abash-in-a-sentence/][Abash]]

  =to humiliate someone and make them feel embarrassed or ashamed=

  - The officer tried to abash the inmates, humiliating them and treating them like dogs.
  - Daniel’s tendency to abash his wife left her embarrassed and thinking about divorce.
  - Though he claims he didn’t mean to abash his brother, the man has a long history of embarrassing him in public.
  - Ross vowed to humiliate his opponent and abash him in any way possible.



* [[https://wordsinasentence.com/abdicate-in-a-sentence/][Abdicate]]

  =to stop accepting a particular responsibility or obligation that you have=

  - The young prince became king after his older brother decided to abdicate the throne.
  - Because the mother chose to abdicate her role as a parent, her children have become the terrors of the neighborhood.
  - Of course, it is easier to abdicate your responsibilities than to be a good citizen.
  - Since the dictator of that country will not simply abdicate his position, we must go to war to remove him from power.
  - It is obvious from the bad behavior of these children that their parents have chosen to abdicate their jobs as good role models.
  - Angry at her husband, the wife decided to abdicate her household position of cook and cleaner for a whole week.
  - Although my daughter is getting married to a wonderful man today, it is still very hard for me to abdicate my role as her protector.



* [[https://wordsinasentence.com/abjure-in-a-sentence/][Abjure]]

  =to give up a belief or an activity=

  - After the tyrant took over the country, the citizens had to abjure their political beliefs.
  - In order to marry the peasant he loved, the prince made the decision to abjure his title.
  - Because John ignored his parents’ plea to abjure a life of crime, he ended up in prison by making bad choices.
  - Although chocolate cake is Martha’s favorite dessert, she has chosen to abjure it while on her diet.
  - While the military leader claimed to abjure unnecessary violence, he was quick to send his soldiers off to battle.
  - Because the heiress does not care about money, she will abjure her inheritance and request that it be donated to charity.
  - We could not believe it when Father Lawrence made the choice to abjure his faith and leave the church.



* [[https://wordsinasentence.com/abnegation-in-a-sentence/][Abnegation]]

  =the act of rejecting or refusing something=

  - Her abnegation of ice cream and cookies is due to her Olympic team training.
  - Because everyone knew Jane loved serving the public, they were shocked by her abnegation of the congressional seat.
  - The school counselor hoped she could encourage her students to consider the abnegation of drug use.
  - When Mark decided to protest chemical dumping, he used the abnegation of food and water as his method of protest.
  - Everyone expected the government’s abnegation of responsibility for the long war.
  - If you wish to be a monk, you must not have a problem with the abnegation of worldly possessions.
  - The priest's abnegation of his faith was a shock to everyone in the community.



* [[https://wordsinasentence.com/abominate-in-a-sentence/][Abominate]]

  =to despise intensely=

  - Since I abominate liver, I will starve to death before I eat it.
  - My dogs abominate cold weather so I have to force them outside when the temperature goes below fifty degrees.
  - If you abominate something, you really hate it.
  - As a diehard golf fan, Josh is unwilling to date anyone who claims to abominate the sport.



