ruby/A.html



<div id="outline-container-org469b4f9" class="outline-2">
<h2 id="org469b4f9"><span class="section-number-2">66</span> <a href="https://wordsinasentence.com/averse-in-a-sentence/">Averse</a></h2>
<div class="outline-text-2" id="text-66">
<p>
<code>actively not liking something</code>
</p>

<ul class="org-ul">
<li>For those who are averse to spaghetti, you also have the meal choice of baked chicken with roasted potatoes.</li>
<li>My teenager daughter is averse to chores and usually has to be forced to complete her cleaning duties.</li>
<li>Because I am averse to risk, I never play casino games.</li>
<li>My children are quite averse to the suggestion of having year-round school.</li>
<li>Since my children are averse to broccoli, I have to hide the vegetable in their favorite dishes.</li>
<li>Marilyn is averse to conflict and goes out of her way to avoid disagreements.</li>
<li>Because we all know Betty is averse to heights, we were shocked when she took up skydiving.</li>
</ul>
</div>
</div>



<div id="outline-container-org3f53775" class="outline-2">
<h2 id="org3f53775"><span class="section-number-2">67</span> <a href="https://wordsinasentence.com/avocation-in-a-sentence/">Avocation</a></h2>
<div class="outline-text-2" id="text-67">
<p>
<code>an activity one enjoys when he or she is not working</code>
</p>

<ul class="org-ul">
<li>Recently, Sherman discovered woodworking is the type of avocation he enjoys in his spare time.</li>
<li>In college Josh did not have time for an avocation; he was too busy studying to pursue a hobby.</li>
<li>Trisha excelled at the avocation of sewing and ultimately turned it into a career.</li>
<li>While John saw stamp collecting as a fun avocation, many people saw it as a boring hobby.</li>
</ul>
</div>
</div>



<div id="outline-container-orgdb34868" class="outline-2">
<h2 id="orgdb34868"><span class="section-number-2">68</span> <a href="https://wordsinasentence.com/axiom-in-a-sentence/">Axiom</a></h2>
<div class="outline-text-2" id="text-68">
<p>
<code>a rule or principal that many people accept as true</code>
</p>

<ul class="org-ul">
<li>Although you keep using that axiom as the basis for your paper, the concept itself is not true.</li>
<li>Mrs. Struthers is an awful teacher who does not believe the axiom that states, "all children can learn".</li>
<li>According to the axiom, all men have equal worth.</li>
<li>The axiom of it being cheaper by the dozen is not true when it comes to feeding a large family at today’s market prices.</li>
<li>The actress with the fewest number of lines found it difficult to accept the axiom about there being no small roles only small actors.</li>
<li>When the university disproved the basic axiom of protein replication, the scientific community was shocked and hurried to confirm the new findings.</li>
<li>Unfortunately, the dictator runs his country on the axiom "might makes right".</li>
</ul>
</div>
</div>



<div id="outline-container-org77a2691" class="outline-2">
<h2 id="org77a2691"><span class="section-number-2">69</span> <a href="https://wordsinasentence.com/abase-in-a-sentence/">Abase</a></h2>
<div class="outline-text-2" id="text-69">
<p>
<code>to lower so as to hurt feelings</code>
</p>

<ul class="org-ul">
<li>My stepmother is an evil woman who likes to abase little children because she had a miserable childhood herself.</li>
<li>Because Mark hated himself, he often tried to abase others by calling them names.</li>
<li>I will not remain married to a man who tries to abase me in order to make me feel worthless!</li>
<li>Although I need money badly, I will not abase myself by working for pennies.</li>
<li>The gossip columnist tried to abase the singer’s reputation by spreading lies about him.</li>
<li>Even though John was angry at his wife for losing a thousand dollars, he chose not to abase her with cruel words.</li>
<li>Although Alice bullies smaller kids at school, she does not abase her younger brother at home.</li>
</ul>
</div>
</div>



<div id="outline-container-orga230dfe" class="outline-2">
<h2 id="orga230dfe"><span class="section-number-2">70</span> <a href="https://wordsinasentence.com/abash-in-a-sentence/">Abash</a></h2>
<div class="outline-text-2" id="text-70">
<p>
<code>to humiliate someone and make them feel embarrassed or ashamed</code>
</p>

<ul class="org-ul">
<li>The officer tried to abash the inmates, humiliating them and treating them like dogs.</li>
<li>Daniel’s tendency to abash his wife left her embarrassed and thinking about divorce.</li>
<li>Though he claims he didn’t mean to abash his brother, the man has a long history of embarrassing him in public.</li>
<li>Ross vowed to humiliate his opponent and abash him in any way possible.</li>
</ul>
</div>
</div>



<div id="outline-container-orgbef632e" class="outline-2">
<h2 id="orgbef632e"><span class="section-number-2">71</span> <a href="https://wordsinasentence.com/abdicate-in-a-sentence/">Abdicate</a></h2>
<div class="outline-text-2" id="text-71">
<p>
<code>to stop accepting a particular responsibility or obligation that you have</code>
</p>

<ul class="org-ul">
<li>The young prince became king after his older brother decided to abdicate the throne.</li>
<li>Because the mother chose to abdicate her role as a parent, her children have become the terrors of the neighborhood.</li>
<li>Of course, it is easier to abdicate your responsibilities than to be a good citizen.</li>
<li>Since the dictator of that country will not simply abdicate his position, we must go to war to remove him from power.</li>
<li>It is obvious from the bad behavior of these children that their parents have chosen to abdicate their jobs as good role models.</li>
<li>Angry at her husband, the wife decided to abdicate her household position of cook and cleaner for a whole week.</li>
<li>Although my daughter is getting married to a wonderful man today, it is still very hard for me to abdicate my role as her protector.</li>
</ul>
</div>
</div>



<div id="outline-container-org217684a" class="outline-2">
<h2 id="org217684a"><span class="section-number-2">72</span> <a href="https://wordsinasentence.com/abjure-in-a-sentence/">Abjure</a></h2>
<div class="outline-text-2" id="text-72">
<p>
<code>to give up a belief or an activity</code>
</p>

<ul class="org-ul">
<li>After the tyrant took over the country, the citizens had to abjure their political beliefs.</li>
<li>In order to marry the peasant he loved, the prince made the decision to abjure his title.</li>
<li>Because John ignored his parents’ plea to abjure a life of crime, he ended up in prison by making bad choices.</li>
<li>Although chocolate cake is Martha’s favorite dessert, she has chosen to abjure it while on her diet.</li>
<li>While the military leader claimed to abjure unnecessary violence, he was quick to send his soldiers off to battle.</li>
<li>Because the heiress does not care about money, she will abjure her inheritance and request that it be donated to charity.</li>
<li>We could not believe it when Father Lawrence made the choice to abjure his faith and leave the church.</li>
</ul>
</div>
</div>



<div id="outline-container-orgc279c25" class="outline-2">
<h2 id="orgc279c25"><span class="section-number-2">73</span> <a href="https://wordsinasentence.com/abnegation-in-a-sentence/">Abnegation</a></h2>
<div class="outline-text-2" id="text-73">
<p>
<code>the act of rejecting or refusing something</code>
</p>

<ul class="org-ul">
<li>Her abnegation of ice cream and cookies is due to her Olympic team training.</li>
<li>Because everyone knew Jane loved serving the public, they were shocked by her abnegation of the congressional seat.</li>
<li>The school counselor hoped she could encourage her students to consider the abnegation of drug use.</li>
<li>When Mark decided to protest chemical dumping, he used the abnegation of food and water as his method of protest.</li>
<li>Everyone expected the government’s abnegation of responsibility for the long war.</li>
<li>If you wish to be a monk, you must not have a problem with the abnegation of worldly possessions.</li>
<li>The priest's abnegation of his faith was a shock to everyone in the community.</li>
</ul>
</div>
</div>



<div id="outline-container-orga625daf" class="outline-2">
<h2 id="orga625daf"><span class="section-number-2">74</span> <a href="https://wordsinasentence.com/abominate-in-a-sentence/">Abominate</a></h2>
<div class="outline-text-2" id="text-74">
<p>
<code>to despise intensely</code>
</p>

<ul class="org-ul">
<li>Since I abominate liver, I will starve to death before I eat it.</li>
<li>My dogs abominate cold weather so I have to force them outside when the temperature goes below fifty degrees.</li>
<li>If you abominate something, you really hate it.</li>
<li>As a diehard golf fan, Josh is unwilling to date anyone who claims to abominate the sport.</li>
</ul>
</div>
</div>
