ruby/A.org
* [[https://wordsinasentence.com/abraded-in-a-sentence/][Abraded]]

  =to produce damage or irritation by scraping, rubbing, or crushing=

  - The wool blanket abraded my legs and gave me a rash.
  - When my husband saw how his facial hair abraded my skin, he decided it was time to shave.
  - The uncomfortable shoe strap abraded my heel and created a sore.
  - Because the pencil was held so tightly against my finger, it abraded my skin and left a red mark.



* [[https://wordsinasentence.com/abrogate-in-a-sentence/][Abrogate]]

  =to abolish; to do away with=

  - You cannot abrogate anyone's right to free speech!
  - With thunderstorms rolling in this afternoon, we may abrogate today's outdoor protest.
  - A good father would never abrogate his parental responsibilities.
  - Our city needs to abrogate outdated laws.
  - More cities are beginning to abrogate smoking in public places because of second-hand smoke hazards.
  - Animal lovers are protesting to abrogate the use of animals in science.
  - Because we have a signed contract, you cannot abrogate your end of the agreement.





* [[https://wordsinasentence.com/abstemious-in-a-sentence/][Abstemious]]

  =marked by moderation and holding back on indulgence=

  - Gerald was abstemious at dinner and only ate a little of the food on his plate.
  - Because I was abstemious with alcohol when I was younger, I am still quite healthy in my later years.
  - The best way to avoid becoming obese is by being abstemious and only eating what is necessary to survive.
  - While Mr. Peterson was quite abstemious with his meals, he always put out a big feast when he had guests over for dinner.
  - The monks had an abstemious diet which consisted chiefly of chicken, bread, water, and cabbage.
  - Even though Mrs. Washington was a very wealthy woman, she still lived an abstemious life and only spent money on the basic essentials.
  - Because of his religion, Pierre is abstemious and does not eat meat.



* [[https://wordsinasentence.com/abstention/][Abstention]]

  =a decision to not vote for or against a proposition=

  - I decided to settle on an abstention when the family voted on where we should eat, as personally I didn’t care where we went.
  - If you do not vote for or against something, you have instead decided on abstention, remaining neutral.
  - Abstentions occur most often in Congress, when a senator may choose to not vote for or against a proposed notion.
  - If you have ever refused to take sides in something, you know exactly what it means to prefer an abstention over a decision.



* [[https://wordsinasentence.com/abstinence-in-a-sentence/][Abstinence]]

  =the act of not taking part in something=

  - According to my religion, one should refrain from having sex and practice abstinence until marriage.
  - Abstinence from smoking is now mandatory on commercial airlines.
  - Because of strong family support, Frank has been able to maintain his abstinence from alcohol for over twelve years.
  - The goal of the church’s teen youth group is to promote abstinence from sex, drugs, and alcohol.
  - Because I am a diabetic, I plan my menus with a focus on abstinence from sugar.
  - Abstinence from sex is the only sure way to prevent unwanted pregnancies.
  - On certain religious holidays, the people in my family eat only fish and maintain an abstinence from other meats.



* [[https://wordsinasentence.com/acclaim-in-a-sentence/][Acclaim]]

  =public praise and applause=

  - Showered with acclaim, the dancer loved all of the praise she was getting from the crowd.
  - The café won widespread acclaim for its amazing shrimp dishes and yummy desserts.
  - Since her last movie, the amazing actress has won national acclaim and several Hollywood roles.
  - The popular newspaper has received international acclaim and several national awards.



* [[https://wordsinasentence.com/accosted-in-a-sentence/][Accosted]]

  =forcefully confronted=

  - When the man accosted me with a gun, I quickly handed over my purse.
  - The policemen asked Greg to describe the man who accosted him.
  - Because the star hates to be accosted by her fans, she wears disguises when she goes out in public.
  - The man who accosted the woman he met online will be going to prison for ten years.



* [[https://wordsinasentence.com/accretion-in-a-sentence/][Accretion]]

  =act of increasing by natural growth=

  - The accretion of traffic accidents and drunk driving was attributed to the opening of the new downtown mall.
  - The gradual accretion of terror over many years left hundred dead and thousands wounded.
  - Sophia was convinced that the accretion of ice on her car’s windshield was preventing her wipers from operating correctly.
  - Coca Cola estimated about 40 cents of lost earnings per share accretion due to the devaluation of their stock.



* [[https://wordsinasentence.com/accrue-in-a-sentence/][Accrue]]

  =increase=

  - Even though a traditional savings count will accrue a small amount of interest every year, other types of investments are better hedges against inflation.
  - The benefits of following a healthy lifestyle will accrue over time.
  - If you don’t want the tax penalties to accrue until they’re unmanageable, you’d better work out a payment plan with the IRS.
  - I enjoy using this credit card because the more I use it for purchases, the more mileage points I can accrue.
  - At last, Brad felt that he had brought his company to a point where he could just stand back and accrue the profits.
  - When Jim was first hired, his supervisor told him that the longer he stayed with the company, the more benefits he would accrue.
  - We really have to clean out the storeroom because the more surplus junk we accrue, the less room we have for anything.



