ruby/A.html



<div id="outline-container-org518cadc" class="outline-2">
<h2 id="org518cadc"><span class="section-number-2">75</span> <a href="https://wordsinasentence.com/abraded-in-a-sentence/">Abraded</a></h2>
<div class="outline-text-2" id="text-75">
<p>
<code>to produce damage or irritation by scraping, rubbing, or crushing</code>
</p>

<ul class="org-ul">
<li>The wool blanket abraded my legs and gave me a rash.</li>
<li>When my husband saw how his facial hair abraded my skin, he decided it was time to shave.</li>
<li>The uncomfortable shoe strap abraded my heel and created a sore.</li>
<li>Because the pencil was held so tightly against my finger, it abraded my skin and left a red mark.</li>
</ul>
</div>
</div>



<div id="outline-container-org47e3da4" class="outline-2">
<h2 id="org47e3da4"><span class="section-number-2">76</span> <a href="https://wordsinasentence.com/abrogate-in-a-sentence/">Abrogate</a></h2>
<div class="outline-text-2" id="text-76">
<p>
<code>to abolish; to do away with</code>
</p>

<ul class="org-ul">
<li>You cannot abrogate anyone's right to free speech!</li>
<li>With thunderstorms rolling in this afternoon, we may abrogate today's outdoor protest.</li>
<li>A good father would never abrogate his parental responsibilities.</li>
<li>Our city needs to abrogate outdated laws.</li>
<li>More cities are beginning to abrogate smoking in public places because of second-hand smoke hazards.</li>
<li>Animal lovers are protesting to abrogate the use of animals in science.</li>
<li>Because we have a signed contract, you cannot abrogate your end of the agreement.</li>
</ul>


<ul class="org-ul">
<li>The bus came to an abrupt halt outside the school.</li>
<li>Our conversation came to an abrupt end when George burst into the room.</li>
<li>The accident brought his career to an abrupt end.</li>
<li>Artie knocked me off-balance with his abrupt change of subject.</li>
</ul>
</div>
</div>



<div id="outline-container-orgf0cce7c" class="outline-2">
<h2 id="orgf0cce7c"><span class="section-number-2">77</span> <a href="https://wordsinasentence.com/abstemious-in-a-sentence/">Abstemious</a></h2>
<div class="outline-text-2" id="text-77">
<p>
<code>marked by moderation and holding back on indulgence</code>
</p>

<ul class="org-ul">
<li>Gerald was abstemious at dinner and only ate a little of the food on his plate.</li>
<li>Because I was abstemious with alcohol when I was younger, I am still quite healthy in my later years.</li>
<li>The best way to avoid becoming obese is by being abstemious and only eating what is necessary to survive.</li>
<li>While Mr. Peterson was quite abstemious with his meals, he always put out a big feast when he had guests over for dinner.</li>
<li>The monks had an abstemious diet which consisted chiefly of chicken, bread, water, and cabbage.</li>
<li>Even though Mrs. Washington was a very wealthy woman, she still lived an abstemious life and only spent money on the basic essentials.</li>
<li>Because of his religion, Pierre is abstemious and does not eat meat.</li>
</ul>
</div>
</div>



<div id="outline-container-org90642b4" class="outline-2">
<h2 id="org90642b4"><span class="section-number-2">78</span> <a href="https://wordsinasentence.com/abstention/">Abstention</a></h2>
<div class="outline-text-2" id="text-78">
<p>
<code>a decision to not vote for or against a proposition</code>
</p>

<ul class="org-ul">
<li>I decided to settle on an abstention when the family voted on where we should eat, as personally I didn’t care where we went.</li>
<li>If you do not vote for or against something, you have instead decided on abstention, remaining neutral.</li>
<li>Abstentions occur most often in Congress, when a senator may choose to not vote for or against a proposed notion.</li>
<li>If you have ever refused to take sides in something, you know exactly what it means to prefer an abstention over a decision.</li>
</ul>
</div>
</div>



<div id="outline-container-org29c54c7" class="outline-2">
<h2 id="org29c54c7"><span class="section-number-2">79</span> <a href="https://wordsinasentence.com/abstinence-in-a-sentence/">Abstinence</a></h2>
<div class="outline-text-2" id="text-79">
<p>
<code>the act of not taking part in something</code>
</p>

<ul class="org-ul">
<li>According to my religion, one should refrain from having sex and practice abstinence until marriage.</li>
<li>Abstinence from smoking is now mandatory on commercial airlines.</li>
<li>Because of strong family support, Frank has been able to maintain his abstinence from alcohol for over twelve years.</li>
<li>The goal of the church’s teen youth group is to promote abstinence from sex, drugs, and alcohol.</li>
<li>Because I am a diabetic, I plan my menus with a focus on abstinence from sugar.</li>
<li>Abstinence from sex is the only sure way to prevent unwanted pregnancies.</li>
<li>On certain religious holidays, the people in my family eat only fish and maintain an abstinence from other meats.</li>
</ul>
</div>
</div>



<div id="outline-container-org4e99c62" class="outline-2">
<h2 id="org4e99c62"><span class="section-number-2">80</span> <a href="https://wordsinasentence.com/acclaim-in-a-sentence/">Acclaim</a></h2>
<div class="outline-text-2" id="text-80">
<p>
<code>public praise and applause</code>
</p>

<ul class="org-ul">
<li>Showered with acclaim, the dancer loved all of the praise she was getting from the crowd.</li>
<li>The café won widespread acclaim for its amazing shrimp dishes and yummy desserts.</li>
<li>Since her last movie, the amazing actress has won national acclaim and several Hollywood roles.</li>
<li>The popular newspaper has received international acclaim and several national awards.</li>
</ul>
</div>
</div>



<div id="outline-container-org2da63b5" class="outline-2">
<h2 id="org2da63b5"><span class="section-number-2">81</span> <a href="https://wordsinasentence.com/accosted-in-a-sentence/">Accosted</a></h2>
<div class="outline-text-2" id="text-81">
<p>
<code>forcefully confronted</code>
</p>

<ul class="org-ul">
<li>When the man accosted me with a gun, I quickly handed over my purse.</li>
<li>The policemen asked Greg to describe the man who accosted him.</li>
<li>Because the star hates to be accosted by her fans, she wears disguises when she goes out in public.</li>
<li>The man who accosted the woman he met online will be going to prison for ten years.</li>
</ul>
</div>
</div>



<div id="outline-container-org4dd3700" class="outline-2">
<h2 id="org4dd3700"><span class="section-number-2">82</span> <a href="https://wordsinasentence.com/accretion-in-a-sentence/">Accretion</a></h2>
<div class="outline-text-2" id="text-82">
<p>
<code>act of increasing by natural growth</code>
</p>

<ul class="org-ul">
<li>The accretion of traffic accidents and drunk driving was attributed to the opening of the new downtown mall.</li>
<li>The gradual accretion of terror over many years left hundred dead and thousands wounded.</li>
<li>Sophia was convinced that the accretion of ice on her car’s windshield was preventing her wipers from operating correctly.</li>
<li>Coca Cola estimated about 40 cents of lost earnings per share accretion due to the devaluation of their stock.</li>
</ul>
</div>
</div>



<div id="outline-container-org21a6da6" class="outline-2">
<h2 id="org21a6da6"><span class="section-number-2">83</span> <a href="https://wordsinasentence.com/accrue-in-a-sentence/">Accrue</a></h2>
<div class="outline-text-2" id="text-83">
<p>
<code>increase</code>
</p>

<ul class="org-ul">
<li>Even though a traditional savings count will accrue a small amount of interest every year, other types of investments are better hedges against inflation.</li>
<li>The benefits of following a healthy lifestyle will accrue over time.</li>
<li>If you don’t want the tax penalties to accrue until they’re unmanageable, you’d better work out a payment plan with the IRS.</li>
<li>I enjoy using this credit card because the more I use it for purchases, the more mileage points I can accrue.</li>
<li>At last, Brad felt that he had brought his company to a point where he could just stand back and accrue the profits.</li>
<li>When Jim was first hired, his supervisor told him that the longer he stayed with the company, the more benefits he would accrue.</li>
<li>We really have to clean out the storeroom because the more surplus junk we accrue, the less room we have for anything.</li>
</ul>
</div>
</div>
