ruby/A.org
* [[https://wordsinasentence.com/acquittal-in-a-sentence/][Acquittal]]

  =a setting free from the charge of an offense or verdict=

  - After the defendant learned of his acquittal, he jumped for joy.
  - Everyone was shocked by the killer’s acquittal which allowed him to leave prison.
  - When there is not enough evidence, a criminal case will usually end with an acquittal.
  - The man’s foreign diplomat status ensures he will receive an acquittal on any charge.
  - When the accused serial killer received an acquittal, the entire country was enraged.
  - Although the defendant received an acquittal on the most serious charges, he still has to go to prison for one year on minor charges.
  - The animal rights group was far from happy when the suspected puppy killer received an acquittal for the offense.



* [[https://wordsinasentence.com/acuity-in-a-sentence/][Acuity]]

  =sharpness in relation to thought, vision, or hearing=

  - In order for my daughter to get into the school’s gifted program, she had to take a mental acuity test.
  - A sniper’s visual acuity has to be exceptional because he must be able to clearly see his targets.
  - According to many people, smoking marijuana does not decrease your intellectual acuity.
  - Owls make use of their excellent visual acuity to chase their prey at night.
  - As the admissions board reviewed the college applications, the members focused on accepting only students with the highest academic acuity.
  - Glaucoma has greatly lessened my grandmother’s visual acuity.
  - As soon as I put on my glasses, my optical acuity improved.



* [[https://wordsinasentence.com/acumen-in-a-sentence/][Acumen]]

  =experience or expertise in something=

  - John’s business acumen, along with his computer skills, made him an asset to the software company.
  - While you excel in the area of customer service, you do not possess the financial acumen necessary to become a branch manager.
  - Although Sarah wants to become a state senator, she lacks the political acumen to win enough votes.
  - You need more than acumen to become a successful car salesperson.
  - The acumen displayed by our principal is the reason our school is one of the best in the nation.
  - Since you have made so many unprofitable trades, your business acumen is in question!
  - Attorneys with acumen are highly valued at any law firm.



* [[https://wordsinasentence.com/addle-in-a-sentence/][Addle]]

  =to cause a person’s thoughts to become jumbled or confused=

  - Is it true smoking marijuana can addle your brain and make it difficult for you to concentrate?
  - When the test questions started to addle my brain, my head began to hurt.
  - The disease will addle your grandmother’s mental capacity and cause her to lose her memory.
  - Because the professor is not a good teacher, he is indifferent when his students tell him that his complex lectures addle their brains.



* [[https://wordsinasentence.com/adduce-in-a-sentence/][Adduce]]

  =to produce as support during a discussion or argument=

  - During the trial the defense attorney will adduce evidence to show the defendant’s innocence.
  - The rookie debate team lost the challenge because it failed to adduce facts supporting its position.
  - If you cannot adduce proof you are the sole creator of the concept, I will split the bonus among the entire team.
  - The city attorney will adduce the man’s toxicology report to prove he was driving drunk.



* [[https://wordsinasentence.com/adjourn-in-a-sentence/][Adjourn]]

  =to suspend or conclude an event=

  - After church services adjourn at one o’clock, we will have our monthly picnic.
  - It is late so we will adjourn this debate until tomorrow.
  - Until the director finds another lead actress, we will adjourn the production of the film.
  - The trial will adjourn until nine o’clock in the morning.


* [[https://wordsinasentence.com/adjudicate-in-a-sentence/][Adjudicate]]

  =to make a decision on an issue=

  - The administrative board will adjudicate on the terms of the doctor’s suspension for misconduct.
  - Because Jack is the president, he is the one who must adjudicate whether or not to lay off workers.
  - You should never adjudicate a major decision when you are under the influence of alcohol.
  - In a national criminal case, the federal authorities are the ones who adjudicate the charges.



* [[https://wordsinasentence.com/adolescence-in-a-sentence/][Adolescence]]

  =the time period when a young person becomes a grownup=

  - When children reach the period of adolescence, they crave freedom to make their own choices.
  - Perhaps my worse challenge during adolescence was the acne that covered my face.
  - During adolescence, Marcus really began to think about what he wanted to study in college.
  - Lionel’s voice deepened during adolescence.



* [[https://wordsinasentence.com/adroit-in-a-sentence/][Adroit]]

  =clever or skillful=

  - The child was an adroit pianist at an early age.
  - Because Leonard is adroit at mental calculations, he is able to effortlessly solve complicated math problems.
  - Their rugby team consists of several adroit players.
  - Even though Gwen had been taking violin lessons for years, she was still not very adroit at playing compositions.
  - The butler was adroit at running a large household.
  - When it comes to managing your money, it is obvious you are not very adroit with financial matters!
  - My cousin Lenny is an adroit fisherman.



* [[https://wordsinasentence.com/adulterate-in-a-sentence/][Adulterate]]

  =to make a substance less pure by adding something else to it=

  - If you want to adulterate your alcoholic drink, you should add some water to it.
  - The restaurant was fined for trying to adulterate the beef with cheap meats.
  - The evil pharmacist was arrested after he tried to adulterate the cancer medicines for profit.
  - As the parent of a young child, I often adulterate the apple juice in my house with water.
  - The manufacturers of cheap olive oil often adulterate the liquid to increase their supply of the merchandise.
  - Although the company swears it does not adulterate its products, it is obvious to everyone that the quality of the firm’s goods has greatly decreased.
  - During Sunday morning church service, it is my job to adulterate the wine so it is weak enough for everyone to safely drink.



