ruby/A.html



<div id="outline-container-org97f8bfc" class="outline-2">
<h2 id="org97f8bfc"><span class="section-number-2">84</span> <a href="https://wordsinasentence.com/acquittal-in-a-sentence/">Acquittal</a></h2>
<div class="outline-text-2" id="text-84">
<p>
<code>a setting free from the charge of an offense or verdict</code>
</p>

<ul class="org-ul">
<li>After the defendant learned of his acquittal, he jumped for joy.</li>
<li>Everyone was shocked by the killer’s acquittal which allowed him to leave prison.</li>
<li>When there is not enough evidence, a criminal case will usually end with an acquittal.</li>
<li>The man’s foreign diplomat status ensures he will receive an acquittal on any charge.</li>
<li>When the accused serial killer received an acquittal, the entire country was enraged.</li>
<li>Although the defendant received an acquittal on the most serious charges, he still has to go to prison for one year on minor charges.</li>
<li>The animal rights group was far from happy when the suspected puppy killer received an acquittal for the offense.</li>
</ul>
</div>
</div>



<div id="outline-container-org74907b5" class="outline-2">
<h2 id="org74907b5"><span class="section-number-2">85</span> <a href="https://wordsinasentence.com/acuity-in-a-sentence/">Acuity</a></h2>
<div class="outline-text-2" id="text-85">
<p>
<code>sharpness in relation to thought, vision, or hearing</code>
</p>

<ul class="org-ul">
<li>In order for my daughter to get into the school’s gifted program, she had to take a mental acuity test.</li>
<li>A sniper’s visual acuity has to be exceptional because he must be able to clearly see his targets.</li>
<li>According to many people, smoking marijuana does not decrease your intellectual acuity.</li>
<li>Owls make use of their excellent visual acuity to chase their prey at night.</li>
<li>As the admissions board reviewed the college applications, the members focused on accepting only students with the highest academic acuity.</li>
<li>Glaucoma has greatly lessened my grandmother’s visual acuity.</li>
<li>As soon as I put on my glasses, my optical acuity improved.</li>
</ul>
</div>
</div>



<div id="outline-container-orgf42ada8" class="outline-2">
<h2 id="orgf42ada8"><span class="section-number-2">86</span> <a href="https://wordsinasentence.com/acumen-in-a-sentence/">Acumen</a></h2>
<div class="outline-text-2" id="text-86">
<p>
<code>experience or expertise in something</code>
</p>

<ul class="org-ul">
<li>John’s business acumen, along with his computer skills, made him an asset to the software company.</li>
<li>While you excel in the area of customer service, you do not possess the financial acumen necessary to become a branch manager.</li>
<li>Although Sarah wants to become a state senator, she lacks the political acumen to win enough votes.</li>
<li>You need more than acumen to become a successful car salesperson.</li>
<li>The acumen displayed by our principal is the reason our school is one of the best in the nation.</li>
<li>Since you have made so many unprofitable trades, your business acumen is in question!</li>
<li>Attorneys with acumen are highly valued at any law firm.</li>
</ul>
</div>
</div>



<div id="outline-container-orgdfc29cd" class="outline-2">
<h2 id="orgdfc29cd"><span class="section-number-2">87</span> <a href="https://wordsinasentence.com/addle-in-a-sentence/">Addle</a></h2>
<div class="outline-text-2" id="text-87">
<p>
<code>to cause a person’s thoughts to become jumbled or confused</code>
</p>

<ul class="org-ul">
<li>Is it true smoking marijuana can addle your brain and make it difficult for you to concentrate?</li>
<li>When the test questions started to addle my brain, my head began to hurt.</li>
<li>The disease will addle your grandmother’s mental capacity and cause her to lose her memory.</li>
<li>Because the professor is not a good teacher, he is indifferent when his students tell him that his complex lectures addle their brains.</li>
</ul>
</div>
</div>



<div id="outline-container-orgec5e50c" class="outline-2">
<h2 id="orgec5e50c"><span class="section-number-2">88</span> <a href="https://wordsinasentence.com/adduce-in-a-sentence/">Adduce</a></h2>
<div class="outline-text-2" id="text-88">
<p>
<code>to produce as support during a discussion or argument</code>
</p>

<ul class="org-ul">
<li>During the trial the defense attorney will adduce evidence to show the defendant’s innocence.</li>
<li>The rookie debate team lost the challenge because it failed to adduce facts supporting its position.</li>
<li>If you cannot adduce proof you are the sole creator of the concept, I will split the bonus among the entire team.</li>
<li>The city attorney will adduce the man’s toxicology report to prove he was driving drunk.</li>
</ul>
</div>
</div>



<div id="outline-container-org9d517fe" class="outline-2">
<h2 id="org9d517fe"><span class="section-number-2">89</span> <a href="https://wordsinasentence.com/adjourn-in-a-sentence/">Adjourn</a></h2>
<div class="outline-text-2" id="text-89">
<p>
<code>to suspend or conclude an event</code>
</p>

<ul class="org-ul">
<li>After church services adjourn at one o’clock, we will have our monthly picnic.</li>
<li>It is late so we will adjourn this debate until tomorrow.</li>
<li>Until the director finds another lead actress, we will adjourn the production of the film.</li>
<li>The trial will adjourn until nine o’clock in the morning.</li>
</ul>
</div>
</div>


<div id="outline-container-orgbd8c182" class="outline-2">
<h2 id="orgbd8c182"><span class="section-number-2">90</span> <a href="https://wordsinasentence.com/adjudicate-in-a-sentence/">Adjudicate</a></h2>
<div class="outline-text-2" id="text-90">
<p>
<code>to make a decision on an issue</code>
</p>

<ul class="org-ul">
<li>The administrative board will adjudicate on the terms of the doctor’s suspension for misconduct.</li>
<li>Because Jack is the president, he is the one who must adjudicate whether or not to lay off workers.</li>
<li>You should never adjudicate a major decision when you are under the influence of alcohol.</li>
<li>In a national criminal case, the federal authorities are the ones who adjudicate the charges.</li>
</ul>
</div>
</div>



<div id="outline-container-orgbf14b31" class="outline-2">
<h2 id="orgbf14b31"><span class="section-number-2">91</span> <a href="https://wordsinasentence.com/adolescence-in-a-sentence/">Adolescence</a></h2>
<div class="outline-text-2" id="text-91">
<p>
<code>the time period when a young person becomes a grownup</code>
</p>

<ul class="org-ul">
<li>When children reach the period of adolescence, they crave freedom to make their own choices.</li>
<li>Perhaps my worse challenge during adolescence was the acne that covered my face.</li>
<li>During adolescence, Marcus really began to think about what he wanted to study in college.</li>
<li>Lionel’s voice deepened during adolescence.</li>
</ul>
</div>
</div>



<div id="outline-container-org47c9965" class="outline-2">
<h2 id="org47c9965"><span class="section-number-2">92</span> <a href="https://wordsinasentence.com/adroit-in-a-sentence/">Adroit</a></h2>
<div class="outline-text-2" id="text-92">
<p>
<code>clever or skillful</code>
</p>

<ul class="org-ul">
<li>The child was an adroit pianist at an early age.</li>
<li>Because Leonard is adroit at mental calculations, he is able to effortlessly solve complicated math problems.</li>
<li>Their rugby team consists of several adroit players.</li>
<li>Even though Gwen had been taking violin lessons for years, she was still not very adroit at playing compositions.</li>
<li>The butler was adroit at running a large household.</li>
<li>When it comes to managing your money, it is obvious you are not very adroit with financial matters!</li>
<li>My cousin Lenny is an adroit fisherman.</li>
</ul>
</div>
</div>



<div id="outline-container-org73875e0" class="outline-2">
<h2 id="org73875e0"><span class="section-number-2">93</span> <a href="https://wordsinasentence.com/adulterate-in-a-sentence/">Adulterate</a></h2>
<div class="outline-text-2" id="text-93">
<p>
<code>to make a substance less pure by adding something else to it</code>
</p>

<ul class="org-ul">
<li>If you want to adulterate your alcoholic drink, you should add some water to it.</li>
<li>The restaurant was fined for trying to adulterate the beef with cheap meats.</li>
<li>The evil pharmacist was arrested after he tried to adulterate the cancer medicines for profit.</li>
<li>As the parent of a young child, I often adulterate the apple juice in my house with water.</li>
<li>The manufacturers of cheap olive oil often adulterate the liquid to increase their supply of the merchandise.</li>
<li>Although the company swears it does not adulterate its products, it is obvious to everyone that the quality of the firm’s goods has greatly decreased.</li>
<li>During Sunday morning church service, it is my job to adulterate the wine so it is weak enough for everyone to safely drink.</li>
</ul>
</div>
</div>
