ruby/A.org
* [[https://wordsinasentence.com/advent-in-a-sentence/][Advent]]

  =the coming or arrival of something=

  - With the advent of the internet, working from home has become a real phenomenon.
  - The elder discussed the advent of the messiah and how it would usher in a new world order.
  - The advent of drones is set to usher in a whole new era for photography.
  - Everyone was afraid that the advent of the year 2000 would cause computers to crash the world over.



* [[https://wordsinasentence.com/adventitious-in-a-sentence/][Adventitious]]

  =not natural; foreign=

  - The weird-looking plant is adventitious and not native to this country.
  - While the band was not popular in its native country, it did find adventitious celebrity in other countries.
  - The marine biologist classified the fish as adventitious because it is not normally found in bodies of saltwater.
  - During the surgery, the doctor removed an adventitious particle that did not belong inside of the patient’s body.
  - Janice was detained at the airport when the x-ray scanner picked up adventitious materials on her body.
  - As soon as Gail saw the adventitious man at her wedding, she knew a stranger had crashed her special day.
  - It was easy for the nuns to recognize the adventitious student, the sole boy in the all-girls school.



* [[https://wordsinasentence.com/advert-in-a-sentence/][Advert]]

  =an advertisement=

  - The newspaper advert announced position openings at the local potato plant.
  - To place an advert in the local classifieds will only cost you a few dollars.
  - Over twenty thousand people viewed the online advert offering a million dollar reward for a missing laptop.
  - People were always shocked to learn that the newlyweds met when the husband placed a single and looking advert.



* [[https://wordsinasentence.com/aerate-in-a-sentence/][Aerate]]

  =to cause air to circulate through something=

  - The cleaners needed to aerate the room to get the strong odor out.
  - Without a way to aerate the building, the hot workers were forced to leave early.
  - The drink makers began to aerate their drinks, adding a *fizz* to the products.
  - He needed to aerate the flattened ball before leaving for the court.



* [[https://wordsinasentence.com/aftermath-in-a-sentence/][Aftermath]]

  =the aftereffects or consequences of an unpleasant or destructive event=

  - More frightening than the hurricane was the aftermath and incomprehensible task of rebuilding.
  - Faced with the aftermath of their crime spree, the petty thieves decided to turn themselves in to authorities.
  - Although the aftermath was daunting, nothing could compare to the moment that the tornado struck the building.
  - The avalanche’s aftermath required extensive resources including rescue and clean-up crews.



* [[https://wordsinasentence.com/agape-in-a-sentence/][Agape]]

  =open=

  - Before you eat oysters, clams, or mussels, always check to be sure that the shells are firmly closed and not even a little bit agape.
  - When I first saw the sunset in the Grand Canyon, I could only stand staring with my mouth agape.
  - Even though the tornado left us standing agape in the midst of all our ruined possessions, we couldn’t help feeling a huge sense of gratitude that none of us had been hurt.
  - I didn’t realize how hurtful my words had been until I saw Sherrie’s expression, agape with shock.
  - Despite the danger, Christopher was rooted to the spot as he watched the rabid dog staggering toward him, his jaws agape and slobbering.
  - After everyone jumped and yelled “Surprise,” Candace just stared at everyone, her mouth and eyes agape with astonishment.
  - While her friends stood around her looking agape, Mary Ann threw her engagement ring as far as she could into the ocean.



* [[https://wordsinasentence.com/agnostic-in-a-sentence/][Agnostic]]

  =unsure about the existence of a god or holy being=

  - After my husband became agnostic, he stopped going to church because of his doubt about god's existence.
  - Jill’s agnostic beliefs had her wondering if there was a *deity* who guided her life.
  - If you are skeptical of your religion, you might have become agnostic.
  - John knew he was too agnostic to dedicate his life to the church when he started to doubt the reality of Christ.



* [[https://wordsinasentence.com/agog-in-a-sentence/][Agog]]

  =filled with anticipation and excitement=

  - The little kids were agog as they waited for Santa Claus to arrive.
  - On the way to the concert hall, the teen girls were agog at the thought of seeing their favorite singer.
  - Fans of the movie series are agog about the upcoming release of the new film.
  - From the sidewalk, the well-wishers were agog as they waited for the royal couple to leave the church.



* [[https://wordsinasentence.com/ague-in-a-sentence/][Ague]]

  =a fever that causes you to shake, sweat and feel cold=

  - Dr. Frank determined that his patient acquired ague based on the symptoms but, he realized it was not malaria because the patient had not visited tropical areas lately.
  - Customs agents required the tourist to undergo tests to determine if he would be bringing in ague, Ebola or West Nile virus into the country.
  - After a rash of emergency room visits with patients complaining of fever and shivering, the state revealed an epidemic of ague.
  - Carol believed her son had the flu at first, but after his symptoms persisted he was diagnosed with ague.



* [[https://wordsinasentence.com/ail-in-a-sentence/][Ail]]

  =a trouble, symptom, or affliction=

  - A common ail that afflicts people when they have a cold is a runny nose, but that is just one of the sinus issues that come along with that.
  - I did not go to school today because I had the serious ail of throwing up every few hours from a sour stomach.
  - I cannot name a single ail of a stomach virus that does not strike me as incredibly unpleasant and unwanted.
  - A doctor will always ask what the nature of your ail is when you first visit them so they can narrow down what affliction may be troubling you.



