ruby/A.html



<div id="outline-container-org859c1b9" class="outline-2">
<h2 id="org859c1b9"><span class="section-number-2">94</span> <a href="https://wordsinasentence.com/advent-in-a-sentence/">Advent</a></h2>
<div class="outline-text-2" id="text-94">
<p>
<code>the coming or arrival of something</code>
</p>

<ul class="org-ul">
<li>With the advent of the internet, working from home has become a real phenomenon.</li>
<li>The elder discussed the advent of the messiah and how it would usher in a new world order.</li>
<li>The advent of drones is set to usher in a whole new era for photography.</li>
<li>Everyone was afraid that the advent of the year 2000 would cause computers to crash the world over.</li>
</ul>
</div>
</div>



<div id="outline-container-org79d79a3" class="outline-2">
<h2 id="org79d79a3"><span class="section-number-2">95</span> <a href="https://wordsinasentence.com/adventitious-in-a-sentence/">Adventitious</a></h2>
<div class="outline-text-2" id="text-95">
<p>
<code>not natural; foreign</code>
</p>

<ul class="org-ul">
<li>The weird-looking plant is adventitious and not native to this country.</li>
<li>While the band was not popular in its native country, it did find adventitious celebrity in other countries.</li>
<li>The marine biologist classified the fish as adventitious because it is not normally found in bodies of saltwater.</li>
<li>During the surgery, the doctor removed an adventitious particle that did not belong inside of the patient’s body.</li>
<li>Janice was detained at the airport when the x-ray scanner picked up adventitious materials on her body.</li>
<li>As soon as Gail saw the adventitious man at her wedding, she knew a stranger had crashed her special day.</li>
<li>It was easy for the nuns to recognize the adventitious student, the sole boy in the all-girls school.</li>
</ul>
</div>
</div>



<div id="outline-container-orgeaa928b" class="outline-2">
<h2 id="orgeaa928b"><span class="section-number-2">96</span> <a href="https://wordsinasentence.com/advert-in-a-sentence/">Advert</a></h2>
<div class="outline-text-2" id="text-96">
<p>
<code>an advertisement</code>
</p>

<ul class="org-ul">
<li>The newspaper advert announced position openings at the local potato plant.</li>
<li>To place an advert in the local classifieds will only cost you a few dollars.</li>
<li>Over twenty thousand people viewed the online advert offering a million dollar reward for a missing laptop.</li>
<li>People were always shocked to learn that the newlyweds met when the husband placed a single and looking advert.</li>
</ul>
</div>
</div>



<div id="outline-container-org6e53a54" class="outline-2">
<h2 id="org6e53a54"><span class="section-number-2">97</span> <a href="https://wordsinasentence.com/aerate-in-a-sentence/">Aerate</a></h2>
<div class="outline-text-2" id="text-97">
<p>
<code>to cause air to circulate through something</code>
</p>

<ul class="org-ul">
<li>The cleaners needed to aerate the room to get the strong odor out.</li>
<li>Without a way to aerate the building, the hot workers were forced to leave early.</li>
<li>The drink makers began to aerate their drinks, adding a fizz to the products.</li>
<li>He needed to aerate the flattened ball before leaving for the court.</li>
</ul>
</div>
</div>



<div id="outline-container-org12e1ad4" class="outline-2">
<h2 id="org12e1ad4"><span class="section-number-2">98</span> <a href="https://wordsinasentence.com/aftermath-in-a-sentence/">Aftermath</a></h2>
<div class="outline-text-2" id="text-98">
<p>
<code>the aftereffects or consequences of an unpleasant or destructive event</code>
</p>

<ul class="org-ul">
<li>More frightening than the hurricane was the aftermath and incomprehensible task of rebuilding.</li>
<li>Faced with the aftermath of their crime spree, the petty thieves decided to turn themselves in to authorities.</li>
<li>Although the aftermath was daunting, nothing could compare to the moment that the tornado struck the building.</li>
<li>The avalanche’s aftermath required extensive resources including rescue and clean-up crews.</li>
</ul>
</div>
</div>



<div id="outline-container-orga9d1d60" class="outline-2">
<h2 id="orga9d1d60"><span class="section-number-2">99</span> <a href="https://wordsinasentence.com/agape-in-a-sentence/">Agape</a></h2>
<div class="outline-text-2" id="text-99">
<p>
<code>open</code>
</p>

<ul class="org-ul">
<li>Before you eat oysters, clams, or mussels, always check to be sure that the shells are firmly closed and not even a little bit agape.</li>
<li>When I first saw the sunset in the Grand Canyon, I could only stand staring with my mouth agape.</li>
<li>Even though the tornado left us standing agape in the midst of all our ruined possessions, we couldn’t help feeling a huge sense of gratitude that none of us had been hurt.</li>
<li>I didn’t realize how hurtful my words had been until I saw Sherrie’s expression, agape with shock.</li>
<li>Despite the danger, Christopher was rooted to the spot as he watched the rabid dog staggering toward him, his jaws agape and slobbering.</li>
<li>After everyone jumped and yelled “Surprise,” Candace just stared at everyone, her mouth and eyes agape with astonishment.</li>
<li>While her friends stood around her looking agape, Mary Ann threw her engagement ring as far as she could into the ocean.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb4bc669" class="outline-2">
<h2 id="orgb4bc669"><span class="section-number-2">100</span> <a href="https://wordsinasentence.com/agnostic-in-a-sentence/">Agnostic</a></h2>
<div class="outline-text-2" id="text-100">
<p>
<code>unsure about the existence of a god or holy being</code>
</p>

<ul class="org-ul">
<li>After my husband became agnostic, he stopped going to church because of his doubt about god's existence.</li>
<li>Jill’s agnostic beliefs had her wondering if there was a deity who guided her life.</li>
<li>If you are skeptical of your religion, you might have become agnostic.</li>
<li>John knew he was too agnostic to dedicate his life to the church when he started to doubt the reality of Christ.</li>
</ul>
</div>
</div>



<div id="outline-container-org4621a80" class="outline-2">
<h2 id="org4621a80"><span class="section-number-2">101</span> <a href="https://wordsinasentence.com/agog-in-a-sentence/">Agog</a></h2>
<div class="outline-text-2" id="text-101">
<p>
<code>filled with anticipation and excitement</code>
</p>

<ul class="org-ul">
<li>The little kids were agog as they waited for Santa Claus to arrive.</li>
<li>On the way to the concert hall, the teen girls were agog at the thought of seeing their favorite singer.</li>
<li>Fans of the movie series are agog about the upcoming release of the new film.</li>
<li>From the sidewalk, the well-wishers were agog as they waited for the royal couple to leave the church.</li>
</ul>
</div>
</div>



<div id="outline-container-org7e07664" class="outline-2">
<h2 id="org7e07664"><span class="section-number-2">102</span> <a href="https://wordsinasentence.com/ague-in-a-sentence/">Ague</a></h2>
<div class="outline-text-2" id="text-102">
<p>
<code>a fever that causes you to shake, sweat and feel cold</code>
</p>

<ul class="org-ul">
<li>Dr. Frank determined that his patient acquired ague based on the symptoms but, he realized it was not malaria because the patient had not visited tropical areas lately.</li>
<li>Customs agents required the tourist to undergo tests to determine if he would be bringing in ague, Ebola or West Nile virus into the country.</li>
<li>After a rash of emergency room visits with patients complaining of fever and shivering, the state revealed an epidemic of ague.</li>
<li>Carol believed her son had the flu at first, but after his symptoms persisted he was diagnosed with ague.</li>
</ul>
</div>
</div>



<div id="outline-container-org15f5345" class="outline-2">
<h2 id="org15f5345"><span class="section-number-2">103</span> <a href="https://wordsinasentence.com/ail-in-a-sentence/">Ail</a></h2>
<div class="outline-text-2" id="text-103">
<p>
<code>a trouble, symptom, or affliction</code>
</p>

<ul class="org-ul">
<li>A common ail that afflicts people when they have a cold is a runny nose, but that is just one of the sinus issues that come along with that.</li>
<li>I did not go to school today because I had the serious ail of throwing up every few hours from a sour stomach.</li>
<li>I cannot name a single ail of a stomach virus that does not strike me as incredibly unpleasant an unwanted.</li>
<li>A doctor will always ask what the nature of your ail is when you first visit them so they can narrow down what affliction may be troubling you.</li>
</ul>
</div>
</div>
