ruby/A.org
* [[https://wordsinasentence.com/aleatory-in-a-sentence/][Aleatory]]

  =random, dependent on luck or chance=

  - Rick laughs at anyone who spends money at the slot machines, because it’s a purely aleatory game that has no intellectual component whatsoever.
  - Gambling is aleatory in nature because a payout occurs based on an event outside of one's control.
  - We insisted that the coin toss be completed five times in a row by five different people, ensuring that the results were completely aleatory and unpredictable.
  - Although the throw of a die is supposed to be entirely aleatory, Gregg seems to know how to spin sixes every time.



* [[https://wordsinasentence.com/allay-in-a-sentence/][Allay]]

  =to make quiet or calm=

  - A good teacher will work hard to allay the concerns of a new student.
  - Last night, I spent over an hour trying to allay my daughter’s fears about the boogieman.
  - Jim hoped a doctor’s diagnosis would allay his worry about the rash on his arm.
  - Even though the president has apologized for his lack of action during the crisis, his statement has done nothing to allay public anger.
  - By praying night and day, the people hoped to allay the anger of the gods.
  - Walter tried to allay his wife’s concerns about sending their daughter to an out-of-state college by pointing out the short travel distance by plane.
  - After the terrorist attack, the president made a speech to try and allay the nation’s fears.



* [[https://wordsinasentence.com/ambient-in-a-sentence/][Ambient]]

  =producing a mood or effect by being present=

  - The ambient music in the store made people feel good about shopping.
  - As soon as I smelled the ambient scent, I started to relax on the massage table.
  - The ambient candle created a romantic setting.
  - When my baby heard the ambient sound of the waterfall, she quickly fell asleep.



* [[https://wordsinasentence.com/amnesty-in-a-sentence/][Amnesty]]

  =a formal pardon or reprieve given to one who has committed a criminal or political offense=

  - Although Bill Smith was sentenced to life in prison in 1998, he was later released after receiving amnesty from the president.
  - Dr. Angali was able to return to his native country after receiving amnesty for his political crimes.
  - Although the governor claimed to be an honest man of the people, he did not hesitate to give his wealthy friend amnesty for a tax related crime.
  - The president upset millions of voters when he announced a plan to offer amnesty to illegal immigrants so they could become citizens.
  - Because of overcrowded prison conditions, thousands of prisoners were recently approved for amnesty.
  - There are those who believe giving illegal residents amnesty will only encourage other people to sneak into the country.
  - One day out of the year, the public library offers a “no fine” amnesty to anyone who returns a long overdue book.



* [[https://wordsinasentence.com/ancillary-in-a-sentence/][Ancillary]]

  =in addition to the main unit, worker, or task=

  - If we start the ancillary generators, we should have enough power to keep the main generator online.
  - Language tutoring is just one of the many ancillary services provided by our public library.
  - When you pay an additional twenty dollars for extra legroom on a plane, you are paying the airline an ancillary fee.
  - The ancillary teacher is in the classroom to help the lead teacher meet the needs of all the students.
  - When the company decided to cut costs, it laid off its ancillary workforce first.
  - The venue has a large auditorium and several ancillary rooms with small screens.
  - During her presentation, Heather used many ancillary tools to help enhance her slide show presentation.



* [[https://wordsinasentence.com/animadversion-in-a-sentence/][Animadversion]]

  =a judgmental remark or criticism=

  - The judge warned the hostile lawyer to not make another animadversion to the witness.
  - When Tom was caught cheating on the final exam, he had to endure an animadversion from the talkative principal.
  - The critic despised Patterson’s new book and wrote a lengthy animadversion about the author’s lack of talent.
  - After the editor offended the queen with a spiteful editorial, he received a verbal animadversion from the newspaper owner.



* [[https://wordsinasentence.com/animus-in-a-sentence/][Animus]]

  =an intense feeling of loathing or disgust; hatred=

  - My animus towards my roommate stems from the fact he is constantly stealing my food.
  - Whenever I am around the girl who stole my boyfriend, I experience an animus that makes me want to break something.
  - The detective’s animus towards the victim’s husband led him to ignore other possible suspects.
  - If you hear any animus in my voice, it is because I really dislike my mother-in-law.



* [[https://wordsinasentence.com/anneal-in-a-sentence/][Anneal]]

  =to heat and slow cool metal or glass in order to toughen it=

  - The welder was able to anneal the metal, heating it to make it stronger.
  - The exact temperature required to anneal steel depends on the ingredients of the alloy.
  - If you anneal the metal at too low a temperature, the correct binding process will not take place during heating or cooling.
  - If the glass maker does not properly anneal the pane, it is likely to crack with small temperature changes.



* [[https://wordsinasentence.com/annihilate-in-a-sentence/][Annihilate]]

  =to destroy, to eradicate=

  - During the war, our soldiers will annihilate the enemy and secure our land.
  - Hopefully, the medicine will annihilate the bacteria causing my throat infection.
  - Because the citizens believe the hurricane is going to annihilate the city, they are evacuating their homes.
  - The boxer hopes to annihilate his opponent during the first round of the match.
  - If the fire is not put out soon, it will annihilate the entire subdivision.
  - With just a single spray, I can annihilate all of the ants on my kitchen counter.
  - In the movie, the villain had enough nuclear weapons to annihilate most of the human race.



