ruby/A.html



<div id="outline-container-org31ced37" class="outline-2">
<h2 id="org31ced37"><span class="section-number-2">104</span> <a href="https://wordsinasentence.com/aleatory-in-a-sentence/">Aleatory</a></h2>
<div class="outline-text-2" id="text-104">
<p>
<code>random, dependent on luck or chance</code>
</p>

<ul class="org-ul">
<li>Rick laughs at anyone who spends money at the slot machines, because it’s a purely aleatory game that has no intellectual component whatsoever.</li>
<li>Gambling is aleatory in nature because a payout occurs based on an event outside of one's control.</li>
<li>We insisted that the coin toss be completed five times in a row by five different people, ensuring that the results were completely aleatory and unpredictable.</li>
<li>Although the throw of a die is supposed to be entirely aleatory, Gregg seems to know how to spin sixes every time.</li>
</ul>
</div>
</div>



<div id="outline-container-orgac5ec6c" class="outline-2">
<h2 id="orgac5ec6c"><span class="section-number-2">105</span> <a href="https://wordsinasentence.com/allay-in-a-sentence/">Allay</a></h2>
<div class="outline-text-2" id="text-105">
<p>
<code>to make quiet or calm</code>
</p>

<ul class="org-ul">
<li>A good teacher will work hard to allay the concerns of a new student.</li>
<li>Last night, I spent over an hour trying to allay my daughter’s fears about the boogieman.</li>
<li>Jim hoped a doctor’s diagnosis would allay his worry about the rash on his arm.</li>
<li>Even though the president has apologized for his lack of action during the crisis, his statement has done nothing to allay public anger.</li>
<li>By praying night and day, the people hoped to allay the anger of the gods.</li>
<li>Walter tried to allay his wife’s concerns about sending their daughter to an out-of-state college by pointing out the short travel distance by plane.</li>
<li>After the terrorist attack, the president made a speech to try and allay the nation’s fears.</li>
</ul>
</div>
</div>



<div id="outline-container-orgf6d6e79" class="outline-2">
<h2 id="orgf6d6e79"><span class="section-number-2">106</span> <a href="https://wordsinasentence.com/ambient-in-a-sentence/">Ambient</a></h2>
<div class="outline-text-2" id="text-106">
<p>
<code>producing a mood or effect by being present</code>
</p>

<ul class="org-ul">
<li>The ambient music in the store made people feel good about shopping.</li>
<li>As soon as I smelled the ambient scent, I started to relax on the massage table.</li>
<li>The ambient candle created a romantic setting.</li>
<li>When my baby heard the ambient sound of the waterfall, she quickly fell asleep.</li>
</ul>
</div>
</div>



<div id="outline-container-orgfa6d5f7" class="outline-2">
<h2 id="orgfa6d5f7"><span class="section-number-2">107</span> <a href="https://wordsinasentence.com/amnesty-in-a-sentence/">Amnesty</a></h2>
<div class="outline-text-2" id="text-107">
<p>
<code>a formal pardon or reprieve given to one who has committed a criminal or political offense</code>
</p>

<ul class="org-ul">
<li>Although Bill Smith was sentenced to life in prison in 1998, he was later released after receiving amnesty from the president.</li>
<li>Dr. Angali was able to return to his native country after receiving amnesty for his political crimes.</li>
<li>Although the governor claimed to be an honest man of the people, he did not hesitate to give his wealthy friend amnesty for a tax related crime.</li>
<li>The president upset millions of voters when he announced a plan to offer amnesty to illegal immigrants so they could become citizens.</li>
<li>Because of overcrowded prison conditions, thousands of prisoners were recently approved for amnesty.</li>
<li>There are those who believe giving illegal residents amnesty will only encourage other people to sneak into the country.</li>
<li>One day out of the year, the public library offers a “no fine” amnesty to anyone who returns a long overdue book.</li>
</ul>
</div>
</div>



<div id="outline-container-org821bb86" class="outline-2">
<h2 id="org821bb86"><span class="section-number-2">108</span> <a href="https://wordsinasentence.com/ancillary-in-a-sentence/">Ancillary</a></h2>
<div class="outline-text-2" id="text-108">
<p>
<code>in addition to the main unit, worker, or task</code>
</p>

<ul class="org-ul">
<li>If we start the ancillary generators, we should have enough power to keep the main generator online.</li>
<li>Language tutoring is just one of the many ancillary services provided by our public library.</li>
<li>When you pay an additional twenty dollars for extra legroom on a plane, you are paying the airline an ancillary fee.</li>
<li>The ancillary teacher is in the classroom to help the lead teacher meet the needs of all the students.</li>
<li>When the company decided to cut costs, it laid off its ancillary workforce first.</li>
<li>The venue has a large auditorium and several ancillary rooms with small screens.</li>
<li>During her presentation, Heather used many ancillary tools to help enhance her slide show presentation.</li>
</ul>
</div>
</div>



<div id="outline-container-orgd93fe57" class="outline-2">
<h2 id="orgd93fe57"><span class="section-number-2">109</span> <a href="https://wordsinasentence.com/animadversion-in-a-sentence/">Animadversion</a></h2>
<div class="outline-text-2" id="text-109">
<p>
<code>a judgmental remark or criticism</code>
</p>

<ul class="org-ul">
<li>The judge warned the hostile lawyer to not make another animadversion to the witness.</li>
<li>When Tom was caught cheating on the final exam, he had to endure an animadversion from the talkative principal.</li>
<li>The critic despised Patterson’s new book and wrote a lengthy animadversion about the author’s lack of talent.</li>
<li>After the editor offended the queen with a spiteful editorial, he received a verbal animadversion from the newspaper owner.</li>
</ul>
</div>
</div>



<div id="outline-container-orge81c736" class="outline-2">
<h2 id="orge81c736"><span class="section-number-2">110</span> <a href="https://wordsinasentence.com/animus-in-a-sentence/">Animus</a></h2>
<div class="outline-text-2" id="text-110">
<p>
<code>an intense feeling of loathing or disgust; hatred</code>
</p>

<ul class="org-ul">
<li>My animus towards my roommate stems from the fact he is constantly stealing my food.</li>
<li>Whenever I am around the girl who stole my boyfriend, I experience an animus that makes me want to break something.</li>
<li>The detective’s animus towards the victim’s husband led him to ignore other possible suspects.</li>
<li>If you hear any animus in my voice, it is because I really dislike my mother-in-law.</li>
</ul>
</div>
</div>



<div id="outline-container-org74ec168" class="outline-2">
<h2 id="org74ec168"><span class="section-number-2">111</span> <a href="https://wordsinasentence.com/anneal-in-a-sentence/">Anneal</a></h2>
<div class="outline-text-2" id="text-111">
<p>
<code>to heat and slow cool metal or glass in order to toughen it</code>
</p>

<ul class="org-ul">
<li>The welder was able to anneal the metal, heating it to make it stronger.</li>
<li>The exact temperature required to anneal steel depends on the ingredients of the alloy.</li>
<li>If you anneal the metal at too low a temperature, the correct binding process will not take place during heating or cooling.</li>
<li>If the glass maker does not properly anneal the pane, it is likely to crack with small temperature changes.</li>
</ul>
</div>
</div>



<div id="outline-container-orgfa3684b" class="outline-2">
<h2 id="orgfa3684b"><span class="section-number-2">112</span> <a href="https://wordsinasentence.com/annihilate-in-a-sentence/">Annihilate</a></h2>
<div class="outline-text-2" id="text-112">
<p>
<code>to destroy, to eradicate</code>
</p>

<ul class="org-ul">
<li>During the war, our soldiers will annihilate the enemy and secure our land.</li>
<li>Hopefully, the medicine will annihilate the bacteria causing my throat infection.</li>
<li>Because the citizens believe the hurricane is going to annihilate the city, they are evacuating their homes.</li>
<li>The boxer hopes to annihilate his opponent during the first round of the match.</li>
<li>If the fire is not put out soon, it will annihilate the entire subdivision.</li>
<li>With just a single spray, I can annihilate all of the ants on my kitchen counter.</li>
<li>In the movie, the villain had enough nuclear weapons to annihilate most of the human race.</li>
</ul>
</div>
</div>
