ruby/A.org
* [[https://wordsinasentence.com/antecedent-in-a-sentence/][Antecedent]]

  =something that came before something else and may have influenced or caused it=

  - Can you identify the antecedent that led to Jane’s emotional breakdown?
  - The legal antecedent for this case can easily be found in the law library.
  - In a certain way, my mother is my antecedent because without her I never would have been born.
  - The sentence you wrote is a bit confusing because the pronoun does not have an antecedent describing the person to whom you are referring.
  - Because Jamie is a peaceful man, there must have been some kind of antecedent which caused him to attack the stranger in the park.
  - The act of working towards a goal is the necessary antecedent, which comes before completing that particular achievement.
  - What antecedent caused the two nations to be at war?



* [[https://wordsinasentence.com/aplomb-in-a-sentence/][Aplomb]]

  =confidence and skill shown, especially in a difficult situation; keeping your cool=

  - Because the negotiator handled the hostage situation with aplomb, the kidnapper released everyone without harm.
  - Jason handled his first acting role with aplomb and won over his critics.
  - During the bomb scare, the teacher managed the children with aplomb and kept everyone calm.
  - Vincent was the first magician to successfully perform this magic trick with aplomb.
  - Mark received a job offer because of his ability to handle tasks with aplomb.
  - Although the awards host could not read the television prompter, he still performed his opening number with aplomb that made him the hit of the evening.
  - Even though Jenny was nervous about dancing in her first recital, she executed her steps with aplomb and received a standing ovation from the audience.



* [[https://wordsinasentence.com/apostate-in-a-sentence/][Apostate]]

  =an individual who has rejected his faith or religious convictions=

  - When John challenged his church’s views, the leaders began to see him as an apostate.
  - Anne was viewed as a dangerous apostate once she left the cult.
  - After Katie exposed the church’s secrets, she was regarded as an apostate.
  - To reject a religion that preaches hate and intolerance, I’ll gladly become an apostate.



* [[https://wordsinasentence.com/ardent-in-a-sentence/][Ardent]]

  =feeling great passion, or felt very passionately=

  - When the rock star checks his mail, he almost always finds one or two bizarre gifts from some of his ardent fans.
  - Paul feels out of place among his friends because of his ardent love of classical music.
  - Melissa has always been an ardent supporter of the city’s community theater.
  - As an ardent lover of nature, Philip plans at least two or three hiking vacations every year.
  - As an ardent devotee of the Shopping Network, she had to restructure her budget to avoid going into bankruptcy.
  - Megan had always had an ardent yearning to become a successful actress, so naturally she was elated at the glowing reviews of her performance.
  - It’s amazing how even the most ardent desires you have as a teenager tend to fade away as you face the reality of adulthood.



* [[https://wordsinasentence.com/arraign-in-a-sentence/][Arraign]]

  =to charge someone in a court of law=

  - His lawyer was not present when the suspect was set to arraign.
  - They wanted to arraign the thief for stealing cars on the same day he was arrested.
  - Before he was set to arraign, the judge liked to carefully review each case.
  - The judge had to travel to the hospital to arraign the injured suspect.



* [[https://wordsinasentence.com/arrant-in-a-sentence/][Arrant]]

  =complete, total, or utter (example: "arrant nonsense")=

  - If you allow your son to participate in such arrant nonsense with his friends, he’s going to end up either hurt or in a juvenile detention center.
  - I couldn’t believe she was taken in by such arrant deception.
  - The kitten’s arrant mischievousness has gotten him into all sorts of mishaps.
  - Despite what we’ve all been led to believe, it’s hard to argue with your arrant logic.
  - Because of her arrant devotion to her family, she volunteered to go to the labor camp with them.
  - Becky’s arrant flirtations with Tony *backfired* on her when he asked Charlotte to prom.



* [[https://wordsinasentence.com/asinine-in-a-sentence/][Asinine]]

  =very stupid or foolish=

  - How asinine of you to pay for a television in pennies!
  - I will not tolerate your asinine behavior.
  - Out of all the asinine things you have done before, wearing a swim suit in the snow tops the list.
  - Allowing your children to smoke cigarettes is asinine.
  - Your asinine attempt to lie in court is going to cost you big time!
  - Chris would exhibit his asinine behavior by throwing garbage at the protestors.
  - This asinine person had the nerve to cut me in line.



* [[https://wordsinasentence.com/askance-in-a-sentence/][Askance]]

  =with doubt or suspicion=

  - The wealthy man looked askance as the gang members approached him.
  - Even though the church members were supposed to be welcoming, they still viewed the stranger askance.
  - Employers tend to look askance at people who change jobs often.
  - As the police officer listened to the woman’s crazy story, he could not help but look askance at her.
  - The insurance agent looked askance at the poor man’s million-dollar claim.
  - When Frank’s rival offered him candy, he could only look askance at him.
  - Carol looked askance at the unfamiliar man walking around her house.



* [[https://wordsinasentence.com/askew-in-a-sentence/][Askew]]

  =tilted to one side; in a crooked position=

  - I’ve tried straightening out the poster three times, but it still looks askew.
  - Even though his *toupee* is almost always askew, he is a funny, endearing character who is welcome at any get-together.
  - When Mia came home and hung her new painting on the wall, she noticed that it was askew in the frame.
  - The first thing Elizabeth noticed when she walked up the sidewalk to her house was that the curtains were askew, as if someone had been watching her from the window.
  - Because the door had been installed askew, it had a tendency to swing open suddenly if I hadn’t closed it securely.
  - Not waiting to knock, Marshall burst through the door with his eyes wild and his hat sitting askew on the side of his head.
  - The detectives looked around the apartment for clues and noticed that the rug seemed to be set askew under the coffee table.



