ruby/A.html



<div id="outline-container-orgd0a974f" class="outline-2">
<h2 id="orgd0a974f"><span class="section-number-2">113</span> <a href="https://wordsinasentence.com/antecedent-in-a-sentence/">Antecedent</a></h2>
<div class="outline-text-2" id="text-113">
<p>
<code>something that came before something else and may have influenced or caused it</code>
</p>

<ul class="org-ul">
<li>Can you identify the antecedent that led to Jane’s emotional breakdown?</li>
<li>The legal antecedent for this case can easily be found in the law library.</li>
<li>In a certain way, my mother is my antecedent because without her I never would have been born.</li>
<li>The sentence you wrote is a bit confusing because the pronoun does not have an antecedent describing the person to whom you are referring.</li>
<li>Because Jamie is a peaceful man, there must have been some kind of antecedent which caused him to attack the stranger in the park.</li>
<li>The act of working towards a goal is the necessary antecedent, which comes before completing that particular achievement.</li>
<li>What antecedent caused the two nations to be at war?</li>
</ul>
</div>
</div>



<div id="outline-container-org33ff066" class="outline-2">
<h2 id="org33ff066"><span class="section-number-2">114</span> <a href="https://wordsinasentence.com/aplomb-in-a-sentence/">Aplomb</a></h2>
<div class="outline-text-2" id="text-114">
<p>
<code>confidence and skill shown, especially in a difficult situation; keeping your cool</code>
</p>

<ul class="org-ul">
<li>Because the negotiator handled the hostage situation with aplomb, the kidnapper released everyone without harm.</li>
<li>Jason handled his first acting role with aplomb and won over his critics.</li>
<li>During the bomb scare, the teacher managed the children with aplomb and kept everyone calm.</li>
<li>Vincent was the first magician to successfully perform this magic trick with aplomb.</li>
<li>Mark received a job offer because of his ability to handle tasks with aplomb.</li>
<li>Although the awards host could not read the television prompter, he still performed his opening number with aplomb that made him the hit of the evening.</li>
<li>Even though Jenny was nervous about dancing in her first recital, she executed her steps with aplomb and received a standing ovation from the audience.</li>
</ul>
</div>
</div>



<div id="outline-container-org243d521" class="outline-2">
<h2 id="org243d521"><span class="section-number-2">115</span> <a href="https://wordsinasentence.com/apostate-in-a-sentence/">Apostate</a></h2>
<div class="outline-text-2" id="text-115">
<p>
<code>an individual who has rejected his faith or religious convictions</code>
</p>

<ul class="org-ul">
<li>When John challenged his church’s views, the leaders began to see him as an apostate.</li>
<li>Anne was viewed as a dangerous apostate once she left the cult.</li>
<li>After Katie exposed the church’s secrets, she was regarded as an apostate.</li>
<li>To reject a religion that preaches hate and intolerance, I’ll gladly become an apostate.</li>
</ul>
</div>
</div>



<div id="outline-container-orgeebd3a4" class="outline-2">
<h2 id="orgeebd3a4"><span class="section-number-2">116</span> <a href="https://wordsinasentence.com/ardent-in-a-sentence/">Ardent</a></h2>
<div class="outline-text-2" id="text-116">
<p>
<code>feeling great passion, or felt very passionately</code>
</p>

<ul class="org-ul">
<li>When the rock star checks his mail, he almost always finds one or two bizarre gifts from some of his ardent fans.</li>
<li>Paul feels out of place among his friends because of his ardent love of classical music.</li>
<li>Melissa has always been an ardent supporter of the city’s community theater.</li>
<li>As an ardent lover of nature, Philip plans at least two or three hiking vacations every year.</li>
<li>As an ardent devotee of the Shopping Network, she had to restructure her budget to avoid going into bankruptcy.</li>
<li>Megan had always had an ardent yearning to become a successful actress, so naturally she was elated at the glowing reviews of her performance.</li>
<li>It’s amazing how even the most ardent desires you have as a teenager tend to fade away as you face the reality of adulthood.</li>
</ul>
</div>
</div>



<div id="outline-container-org3ea8ba4" class="outline-2">
<h2 id="org3ea8ba4"><span class="section-number-2">117</span> <a href="https://wordsinasentence.com/arraign-in-a-sentence/">Arraign</a></h2>
<div class="outline-text-2" id="text-117">
<p>
<code>to charge someone in a court of law</code>
</p>

<ul class="org-ul">
<li>His lawyer was not present when the suspect was set to arraign.</li>
<li>They wanted to arraign the thief for stealing cars on the same day he was arrested.</li>
<li>Before he was set to arraign, the judge liked to carefully review each case.</li>
<li>The judge had to travel to the hospital to arraign the injured suspect.</li>
</ul>
</div>
</div>



<div id="outline-container-orgda0caef" class="outline-2">
<h2 id="orgda0caef"><span class="section-number-2">118</span> <a href="https://wordsinasentence.com/arrant-in-a-sentence/">Arrant</a></h2>
<div class="outline-text-2" id="text-118">
<p>
<code>complete, total, or utter (example: "arrant nonsense")</code>
</p>

<ul class="org-ul">
<li>If you allow your son to participate in such arrant nonsense with his friends, he’s going to end up either hurt or in a juvenile detention center.</li>
<li>I couldn’t believe she was taken in by such arrant deception.</li>
<li>Because of his outrageous conceit and disregard for the feelings of others, Matt is no longer welcome among the A list of the town’s citizens.</li>
<li>The kitten’s arrant mischievousness has gotten him into all sorts of mishaps.</li>
<li>Despite what we’ve all been led to believe, it’s hard to argue with your arrant logic.</li>
<li>Because of her arrant devotion to her family, she volunteered to go to the labor camp with them.</li>
<li>Becky’s arrant flirtations with Tony backfired on her when he asked Charlotte to prom.</li>
</ul>
</div>
</div>



<div id="outline-container-orgdeee961" class="outline-2">
<h2 id="orgdeee961"><span class="section-number-2">119</span> <a href="https://wordsinasentence.com/asinine-in-a-sentence/">Asinine</a></h2>
<div class="outline-text-2" id="text-119">
<p>
<code>very stupid or foolish</code>
</p>

<ul class="org-ul">
<li>How asinine of you to pay for a television in pennies!</li>
<li>I will not tolerate your asinine behavior.</li>
<li>Out of all the asinine things you have done before, wearing a swim suit in the snow tops the list.</li>
<li>Allowing your children to smoke cigarettes is asinine.</li>
<li>Your asinine attempt to lie in court is going to cost you big time!</li>
<li>Chris would exhibit his asinine behavior by throwing garbage at the protestors.</li>
<li>This asinine person had the nerve to cut me in line.</li>
</ul>
</div>
</div>



<div id="outline-container-orgca6330e" class="outline-2">
<h2 id="orgca6330e"><span class="section-number-2">120</span> <a href="https://wordsinasentence.com/askance-in-a-sentence/">Askance</a></h2>
<div class="outline-text-2" id="text-120">
<p>
<code>with doubt or suspicion</code>
</p>

<ul class="org-ul">
<li>The wealthy man looked askance as the gang members approached him.</li>
<li>Even though the church members were supposed to be welcoming, they still viewed the stranger askance.</li>
<li>Employers tend to look askance at people who change jobs often.</li>
<li>As the police officer listened to the woman’s crazy story, he could not help but look askance at her.</li>
<li>The insurance agent looked askance at the poor man’s million-dollar claim.</li>
<li>When Frank’s rival offered him candy, he could only look askance at him.</li>
<li>Carol looked askance at the unfamiliar man walking around her house.</li>
</ul>
</div>
</div>



<div id="outline-container-org841dc9e" class="outline-2">
<h2 id="org841dc9e"><span class="section-number-2">121</span> <a href="https://wordsinasentence.com/askew-in-a-sentence/">Askew</a></h2>
<div class="outline-text-2" id="text-121">
<p>
<code>tilted to one side; in a crooked position</code>
</p>

<ul class="org-ul">
<li>I’ve tried straightening out the poster three times, but it still looks askew.</li>
<li>Even though his toupee is almost always askew, he is a funny, endearing character who is welcome at any get-together.</li>
<li>When Mia came home and hung her new painting on the wall, she noticed that it was askew in the frame.</li>
<li>The first thing Elizabeth noticed when she walked up the sidewalk to her house was that the curtains were askew, as if someone had been watching her from the window.</li>
<li>Because the door had been installed askew, it had a tendency to swing open suddenly if I hadn’t closed it securely.</li>
<li>Not waiting to knock, Marshall burst through the door with his eyes wild and his hat sitting askew on the side of his head.</li>
<li>The detectives looked around the apartment for clues and noticed that the rug seemed to be set askew under the coffee table.</li>
</ul>
</div>
</div>
