ruby/A.org
* [[https://wordsinasentence.com/aspersion-in-a-sentence/][Aspersion]]

  =a false charge meant to harm someone’s reputation=

  - Jack’s political rival cast an aspersion against him right before the election.
  - Because I know Janice is a kind person, I cannot believe the negative aspersion about her.
  - Even though I am angry at you, I will not cast an aspersion upon your character.
  - After Helen was dumped by her boyfriend, she went online and posted an aspersion about him.
  - My friend Jill was right to direct an aspersion against her cheating husband.
  - By spreading that aspersion, you could ruin the teacher’s reputation.
  - The politician’s career was ruined by an aspersion created by his enemies.



* [[https://wordsinasentence.com/assent-in-a-sentence/][Assent]]

  =to agree to something especially after thoughtful consideration=

  - For a while, it seemed as if Karen was not going to assent to Jim’s marriage proposal.
  - The policeman asked if I would assent to a search of my vehicle.
  - When I told Frank I would never assent to a divorce, he stormed out of the house.
  - After Jim read over his teacher’s notes, he could only assent he had not spent enough time on his research paper.
  - Please raise your hands to show you assent to the proposal.
  - Because John did not believe the salesman was being honest with him, he did not assent to the deal.
  - As my marriage is quite important to me, I have decided to assent to couples' therapy.



* [[https://wordsinasentence.com/assuage-in-a-sentence/][Assuage]]

  =to provide relief; causing to feel better=

  - In an effort to assuage angry customers, the store issued everyone a full refund.
  - To help assuage my guilt, I told the truth.
  - Knowing that my grandfather *pulled through* =度过难关= heart surgery does assuage my nerves.
  - Warm soup does very little to assuage my sore throat.
  - Having friends by my side will assuage the worries of becoming a parent.
  - While smoking may assuage stress, it will upset your overall health.
  - Aspirin will assuage your headache.



* [[https://wordsinasentence.com/attire-in-a-sentence/][Attire]]

  =one's dress or clothes=

  - The high school prom required formal attire, but no one was allowed to rent a limousine.
  - After receiving his acceptance to the company, Dan wondered if he was allowed to wear casual attire or suit and tie.
  - Most of the attendants at the mayor’s funeral wore similar attire so that it looked like a sea of dark blackness.
  - When the man woke up on Saturday, he knew his attire would consist of an umpire’s uniform since he would be working at the little league games this season.



* [[https://wordsinasentence.com/augury-in-a-sentence/][Augury]]

  =a prediction or omen=

  - There are those who view the virus as an augury of the world coming to an end.
  - According to the psychic, the black cat was an augury of my impending death.
  - The gloomy music in the movie scene was an augury of an upcoming tragedy.
  - When the fortuneteller read my palm, she saw an augury of bad luck.
  - The clairvoyant gave me a depressing augury that made me want to stay indoors for my own safety.
  - Throughout his painting, the artist uses the color red to represent an augury of death.
  - I knew the white dove flying over my beach wedding was an augury of a bright future.



* [[https://wordsinasentence.com/august-in-a-sentence/][August]]

  =much-admired and respected=

  - Everyone wanted the chance to dine with the august president.
  - When Maggie learned the party was at the august nightclub, she was excited by the thought of meeting some of her favorite celebrities.
  - The critics raved about the august ballerina’s performance.
  - Because John is wealthy and the only son of an august politician, he is one of the country’s most sought-after bachelors.



* [[https://wordsinasentence.com/aver-in-a-sentence/][Aver]]

  =to assert something in a convincing way=

  - Even though the country is in an economic crisis, its leader will aver the nation is doing well during his monthly address.
  - The team’s fans aver a new coach is needed because of the team’s losing record.
  - During the interrogation, the suspect did nothing but aver his innocence.
  - To ease unrest in our company, the boss made a speech to aver policy changes were coming.
  - After our test drive, we listened as the car salesman tried to aver he was offering us the best deal in town.
  - The political candidate’s ads aver he is the best choice for governor.
  - When the teenager talked to her parents, she tried to aver her right for privacy by asking them to not monitor her computer.



* [[https://wordsinasentence.com/aversion-in-a-sentence/][Aversion]]

  =a feeling of disgust toward something with a desire to avoid it=

  - Older people who are unfamiliar with computer technology often have an aversion to it.
  - Because I am allergic to spiders, I have an aversion to the creatures.
  - Vegetarians have a strong aversion to eating meat.
  - When I run into my ex-husband, I experience an aversion so powerful that it makes me sick to my stomach.
  - Mitch has such an aversion to eating liver that he breaks out *in hives* =荨麻疹= whenever someone mentions the meat.
  - Although the price of gasoline has risen three days in a row, drivers appear to have no aversion to filling their tanks.
  - My aversion to stupidity keeps me from frequently interacting through social media.



* [[https://wordsinasentence.com/avow-in-a-sentence/][Avow]]

  =to admit or confess something publicly=

  - Because the man would not avow himself as a follower of the king in front of the villagers, he was sentenced to death.
  - Both of the candidates decided to avow their short comings in an effort to win public sympathy.
  - Romeo set out to avow his love for Juliet in front of a crowd of onlookers.
  - During the town hall meeting, I was too embarrassed to avow that I too had sent thousands of dollars to the senator’s illegal charity.



