ruby/A.html



<div id="outline-container-org07b640a" class="outline-2">
<h2 id="org07b640a"><span class="section-number-2">122</span> <a href="https://wordsinasentence.com/aspersion-in-a-sentence/">Aspersion</a></h2>
<div class="outline-text-2" id="text-122">
<p>
<code>a false charge meant to harm someone’s reputation</code>
</p>

<ul class="org-ul">
<li>Jack’s political rival cast an aspersion against him right before the election.</li>
<li>Because I know Janice is a kind person, I cannot believe the negative aspersion about her.</li>
<li>Even though I am angry at you, I will not cast an aspersion upon your character.</li>
<li>After Helen was dumped by her boyfriend, she went online and posted an aspersion about him.</li>
<li>My friend Jill was right to direct an aspersion against her cheating husband.</li>
<li>By spreading that aspersion, you could ruin the teacher’s reputation.</li>
<li>The politician’s career was ruined by an aspersion created by his enemies.</li>
</ul>
</div>
</div>



<div id="outline-container-orgffb281b" class="outline-2">
<h2 id="orgffb281b"><span class="section-number-2">123</span> <a href="https://wordsinasentence.com/assent-in-a-sentence/">Assent</a></h2>
<div class="outline-text-2" id="text-123">
<p>
<code>to agree to something especially after thoughtful consideration</code>
</p>

<ul class="org-ul">
<li>For a while, it seemed as if Karen was not going to assent to Jim’s marriage proposal.</li>
<li>The policeman asked if I would assent to a search of my vehicle.</li>
<li>When I told Frank I would never assent to a divorce, he stormed out of the house.</li>
<li>After Jim read over his teacher’s notes, he could only assent he had not spent enough time on his research paper.</li>
<li>Please raise your hands to show you assent to the proposal.</li>
<li>Because John did not believe the salesman was being honest with him, he did not assent to the deal.</li>
<li>As my marriage is quite important to me, I have decided to assent to couples' therapy.</li>
</ul>
</div>
</div>



<div id="outline-container-org9ac3e85" class="outline-2">
<h2 id="org9ac3e85"><span class="section-number-2">124</span> <a href="https://wordsinasentence.com/assuage-in-a-sentence/">Assuage</a></h2>
<div class="outline-text-2" id="text-124">
<p>
<code>to provide relief; causing to feel better</code>
</p>

<ul class="org-ul">
<li>In an effort to assuage angry customers, the store issued everyone a full refund.</li>
<li>To help assuage my guilt, I told the truth.</li>
<li>Knowing that my grandfather pulled through heart surgery does assuage my nerves.</li>
<li>Warm soup does very little to assuage my sore throat.</li>
<li>Having friends by my side will assuage the worries of becoming a parent.</li>
<li>While smoking may assuage stress, it will upset your overall health.</li>
<li>Aspirin will assuage your headache.</li>
</ul>
</div>
</div>



<div id="outline-container-org9404ffa" class="outline-2">
<h2 id="org9404ffa"><span class="section-number-2">125</span> <a href="https://wordsinasentence.com/attire-in-a-sentence/">Attire</a></h2>
<div class="outline-text-2" id="text-125">
<p>
<code>one's dress or clothes</code>
</p>

<ul class="org-ul">
<li>The high school prom required formal attire, but no one was allowed to rent a limousine.</li>
<li>After receiving his acceptance to the company, Dan wondered if he was allowed to wear casual attire or suit and tie.</li>
<li>Most of the attendants at the mayor’s funeral wore similar attire so that it looked like a sea of dark blackness.</li>
<li>When the man woke up on Saturday, he knew his attire would consist of an umpire’s uniform since he would be working at the little league games this season.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb4906fc" class="outline-2">
<h2 id="orgb4906fc"><span class="section-number-2">126</span> <a href="https://wordsinasentence.com/augury-in-a-sentence/">Augury</a></h2>
<div class="outline-text-2" id="text-126">
<p>
<code>a prediction or omen</code>
</p>

<ul class="org-ul">
<li>There are those who view the virus as an augury of the world coming to an end.</li>
<li>According to the psychic, the black cat was an augury of my impending death.</li>
<li>The gloomy music in the movie scene was an augury of an upcoming tragedy.</li>
<li>When the fortuneteller read my palm, she saw an augury of bad luck.</li>
<li>The clairvoyant gave me a depressing augury that made me want to stay indoors for my own safety.</li>
<li>Throughout his painting, the artist uses the color red to represent an augury of death.</li>
<li>I knew the white dove flying over my beach wedding was an augury of a bright future.</li>
</ul>
</div>
</div>



<div id="outline-container-org6000a63" class="outline-2">
<h2 id="org6000a63"><span class="section-number-2">127</span> <a href="https://wordsinasentence.com/august-in-a-sentence/">August</a></h2>
<div class="outline-text-2" id="text-127">
<p>
<code>much-admired and respected</code>
</p>

<ul class="org-ul">
<li>Everyone wanted the chance to dine with the august president.</li>
<li>When Maggie learned the party was at the august nightclub, she was excited by the thought of meeting some of her favorite celebrities.</li>
<li>The critics raved about the august ballerina’s performance.</li>
<li>Because John is wealthy and the only son of an august politician, he is one of the country’s most sought-after bachelors.</li>
</ul>
</div>
</div>



<div id="outline-container-org709bd7f" class="outline-2">
<h2 id="org709bd7f"><span class="section-number-2">128</span> <a href="https://wordsinasentence.com/aver-in-a-sentence/">Aver</a></h2>
<div class="outline-text-2" id="text-128">
<p>
<code>to assert something in a convincing way</code>
</p>

<ul class="org-ul">
<li>Even though the country is in an economic crisis, its leader will aver the nation is doing well during his monthly address.</li>
<li>The team’s fans aver a new coach is needed because of the team’s losing record.</li>
<li>During the interrogation, the suspect did nothing but aver his innocence.</li>
<li>To ease unrest in our company, the boss made a speech to aver policy changes were coming.</li>
<li>After our test drive, we listened as the car salesman tried to aver he was offering us the best deal in town.</li>
<li>The political candidate’s ads aver he is the best choice for governor.</li>
<li>When the teenager talked to her parents, she tried to aver her right for privacy by asking them to not monitor her computer.</li>
</ul>
</div>
</div>



<div id="outline-container-org520eb0e" class="outline-2">
<h2 id="org520eb0e"><span class="section-number-2">129</span> <a href="https://wordsinasentence.com/aversion-in-a-sentence/">Aversion</a></h2>
<div class="outline-text-2" id="text-129">
<p>
<code>a feeling of disgust toward something with a desire to avoid it</code>
</p>

<ul class="org-ul">
<li>Older people who are unfamiliar with computer technology often have an aversion to it.</li>
<li>Because I am allergic to spiders, I have an aversion to the creatures.</li>
<li>Vegetarians have a strong aversion to eating meat.</li>
<li>When I run into my ex-husband, I experience an aversion so powerful that it makes me sick to my stomach.</li>
<li>Mitch has such an aversion to eating liver that he breaks out in hives whenever someone mentions the meat.</li>
<li>Although the price of gasoline has risen three days in a row, drivers appear to have no aversion to filling their tanks.</li>
<li>My aversion to stupidity keeps me from frequently interacting through social media.</li>
</ul>
</div>
</div>



<div id="outline-container-org688e45b" class="outline-2">
<h2 id="org688e45b"><span class="section-number-2">130</span> <a href="https://wordsinasentence.com/avow-in-a-sentence/">Avow</a></h2>
<div class="outline-text-2" id="text-130">
<p>
<code>to admit or confess something publicly</code>
</p>

<ul class="org-ul">
<li>Because the man would not avow himself as a follower of the king in front of the villagers, he was sentenced to death.</li>
<li>Both of the candidates decided to avow their short comings in an effort to win public sympathy.</li>
<li>Romeo set out to avow his love for Juliet in front of a crowd of onlookers.</li>
<li>During the town hall meeting, I was too embarrassed to avow that I too had sent thousands of dollars to the senator’s illegal charity.</li>
</ul>
</div>
</div>
