ruby/A.org
* [[https://wordsinasentence.com/awry-in-a-sentence/][Awry]]

  =away from the appropriate, planned, or expected course=

  - After we hit the deer, our road trip seemed to go awry and off course.
  - The inexperienced teacher did not know how to proceed when the troublesome student made her schedule go awry.
  - When the serial killer was released from prison, everyone knew the justice system had gone awry.
  - Mail delivery often goes awry during a winter storm.
  - When there is no supervision, large events can go awry and become chaotic.
  - You should have a backup plan for your wedding in case the weather causes the outdoor ceremony to go awry.
  - In the movie, the hero must try and change the path of a nuclear missile that has gone awry.






#+HTML: <a id="bottom"/>
#+HTML: <a href="#top">⇧</a>