ruby/A.html



<div id="outline-container-org38536ea" class="outline-2">
<h2 id="org38536ea"><span class="section-number-2">131</span> <a href="https://wordsinasentence.com/awry-in-a-sentence/">Awry</a></h2>
<div class="outline-text-2" id="text-131">
<p>
<code>away from the appropriate, planned, or expected course</code>
</p>

<ul class="org-ul">
<li>After we hit the deer, our road trip seemed to go awry and off course.</li>
<li>The inexperienced teacher did not know how to proceed when the troublesome student made her schedule go awry.</li>
<li>When the serial killer was released from prison, everyone knew the justice system had gone awry.</li>
<li>Mail delivery often goes awry during a winter storm.</li>
<li>When there is no supervision, large events can go awry and become chaotic.</li>
<li>You should have a backup plan for your wedding in case the weather causes the outdoor ceremony to go awry.</li>
<li>In the movie, the hero must try and change the path of a nuclear missile that has gone awry.</li>
</ul>






<a id="bottom"/>
<a href="#top">⇧</a>
</div>
</div>
</div>
</body>
</html>